{
  "actions.json": [
    {
      "id": "act_lr_go_diving",
      "name": "Go Diving",
      "activation": "Downtime",
      "terse": "Dive into the seedy underbelly of a station.",
      "detail": "<p>When you dive into the seedy underbelly of a station, first name whatyou&rsquo;re looking for: a good time, a specific person&rsquo;s time, attention, or aid; a useful piece of information, or a useful contact or connection. The GM will tell you if it&rsquo;s attainable or not on this station. You can use this action instead of the &ldquo;Get a Damn Drink&rdquo;action from the core book if you like during downtime.</p><p>Then roll a skill check. Applicable triggers could be Survive, Show off, or Word on the Street.</p><p>You always get what you&rsquo;re looking for, however, on a 9 or lower, roll2d20 &mdash; re-rolling duplicates &mdash; and choose the final results from either of the two tables below, taking both.</p><p>On a 10-19 roll 1d20 and take from either table.<br />On a 20+, roll 2d20, choose one, then pick the final result from either table.<br />You can work backwards after you roll for this action to figure out what happened.</p><p><strong>What did you pick up?</strong></p><table><tbody><tr><td><strong>d20</strong></td><td><strong>Gain</strong></td></tr><tr><td>1</td><td>A splitting headache</td></tr><tr><td>2</td><td>A ledger with a long list of names in it. The corner is spotted with blood, and some of the names are crossed off.</td></tr><tr><td>3</td><td>A large canister of slick, vibrant purple liquid labeled &ldquo;All Purpose Lubricant&rdquo;.</td></tr><tr><td>4</td><td>A brand new, very elaborate Sparri saga tattoo</td></tr><tr><td>5</td><td>A very dry mouth</td></tr><tr><td>6</td><td>An elaborately decorated carnival mask. You cannot remember exactly how you acquired it. The eyes seem to follow you</td></tr><tr><td>7</td><td>An outstanding warrant for your arrest</td></tr><tr><td>8</td><td>A very mild Gliss, Brighteyes, or Gazer addiction</td></tr><tr><td>9</td><td>A mini fridge full of sensitive biological samples wanted by an enterprise</td></tr><tr><td>10</td><td>A station security officer who is very obviously attempting to follow you without you noticing</td></tr><tr><td>11</td><td>A brand new station disease that causes you to break out into hives when someone touches you skin to skin. It&rsquo;ll clear up in a week.</td></tr><tr><td>12</td><td>A thick data wafer with a carefully curated selection of old earth jazz</td></tr><tr><td>13</td><td>An enormous debt to the station crime syndicate</td></tr><tr><td>14</td><td>A large, chitinous, and very affectionate pet krait</td></tr><tr><td>15</td><td>A revolver with one spent bullet in the chamber</td></tr><tr><td>16</td><td>A reputation as &ldquo;Mistress&rdquo;</td></tr><tr><td>17</td><td>The meat sweats</td></tr><tr><td>18</td><td>A pack of unlabeled and suspicious smelling cigarettes.</td></tr><tr><td>19</td><td>A hanger-on named &lsquo;Juicy K&rsquo;. They are a huge fan of you, not very quick on the uptake, but extremely knowledgable about station gossip, current Long Rim pop culture, and varying interesting and creative uses of popular narcotics. They refuse to leave if asked and generally believe the two of you are best friends.</td></tr><tr><td>20</td><td><table><tbody><tr><td>A thick pack of stripped dataplating packed densely with incredibly sensitive information such as military schedules, personal financial records, etc.</td></tr></tbody></table></td></tr></tbody></table><br><p><strong>What did you lose?</strong></p><table><tbody><tr><td><p><strong>d20</strong></p></td><td><p><strong>Loss</strong></p></td></tr><tr><td>1</td><td>Your memory of the previous night.</td></tr><tr><td>2</td><td>Your dignity (if you had any).</td></tr><tr><td>3</td><td>Your sense of balance for the next few hours.</td></tr><tr><td>4</td><td>Any weapons you carried with you. You can find them being sold on the station black market in the next few days.</td></tr><tr><td>5</td><td>Your sense of smell for the next few days.</td></tr><tr><td>6</td><td>Pretty much everything in your stomach from the last day or so.</td></tr><tr><td>7</td><td>Any personal identification, station passes, or important documentation you had on you. You get a message asking for ransom to recover them in the next few minutes.</td></tr><tr><td>8</td><td>About two or three days of local time.</td></tr><tr><td>9</td><td>All the sensation in your fingertips for the next day or so.</td></tr><tr><td>10</td><td>All your hair (it&rsquo;ll grow back).</td></tr><tr><td>11</td><td>Your pants.</td></tr><tr><td>12</td><td>A large part of the skin on your left arm, currently swaddled in abandage you don&rsquo;t remember having applied.</td></tr><tr><td>13</td><td>Your largely positive opinion of the station.</td></tr><tr><td>14</td><td>Your sense of direction.</td></tr><tr><td>15</td><td>Any station credit or loose change you had on you.</td></tr><tr><td>16</td><td>Movement in your face and the ability to feel your tongue for about an hour or so.</td></tr><tr><td>17</td><td>A knife fight.</td></tr><tr><td>18</td><td>Your shoes. You&rsquo;ll spot a station kid wearing them in about an hour.</td></tr><tr><td>19</td><td>One fingernail.</td></tr><tr><td>20</td><td>Free travel around the station, which will be restricted for a while.</td></tr></tbody></table>"
    },
    {
      "id": "act_lr_gunfight",
      "name": "Gunfight",
      "activation": "Downtime",
      "terse": "Get into a one-on-one duel with someone.",
      "detail": "When you get into a one-on-one gun duel with another individual, you can roll gunfight. It could be impromptu or planned. Most duels of honor in the Long Rim are to first blood, not to death, and folk don’t typically shoot to kill, but that can depend on who you pissed off.<br>First, the player rolling decides who shot first, then roll a skill check. Triggers like Take Someone Out or Show Off probably apply here.<br> On a 9 or lower, you miss your shot and choose one of the following:<ul><li>Get shot, taking harm as established</li><li>You duck or weave out of the way and an NPC bystander, important object, or item of the GM’s choice (could be something you’re holding or wearing) takes grievous and lasting harm. If you shot first, the blame for this falls on you. If not, it falls on your opponent.</li></ul>On a 10-19, your shot hits, dealing harm as established. If you shot first, your target doesn’t get a chance to respond. If you didn’t shoot first, take harm as established.<br>On a 20+, your shot instantly kills your opponent (intentionally or not!). If you shot first, you shoot them before they even get a chance to draw, and folk present squarely place the blame for the death on you. If you didn’t shoot first, you are seen as acting at least partly in self defense.<br>If both parties agree, you might go through another round if the duel is not finished after the first round and both of you are still alive."
    }
  ],
  "frames.json": [
    {
      "id": "mf_atlas",
      "source": "SSC",
      "name": "Atlas",
      "mechtype": [
        "Striker"
      ],
      "y_pos": 14,
      "license_level": 2,
      "description": "<p>Originally commissioned as a dueling mech by the Baronic Houses of Smoke and Order, the Atlas blurs the line between mechanized chassis and powered personal armor. Thanks to a long-running research project from SSC's Exotic Materials Group, the designers were able to employ the bleeding edge of reactor miniaturization tech: the result was a chassis that resembled a large, sleek hardsuit, almost skintight in places. While the Atlas sacrifices the durability of a larger frame, its essential systems are so closely melded with its user's movements that it offers unparalleled maneuverability.</p> <p>Although the Atlas was initially licensed only to Baronic clients, its design was leaked when a group of ExoMat personnel lost a suit to a Sparri espada in an intense game of Kapkat. Despite their initial attempt to recover the suit, SSC relented, citing the eager demand from Sparri groups for access to the full license. </p> <p>Considered the perfect warrior frame for hunting the native megafauna of Sparr, the Atlas now enjoys a dual reputation among both the Sparri peoples and Karrakin nobility. To the Sparri, the Atlas &ndash; its combat efficacy notwithstanding &ndash; is highly valued for the direct access its systems allow to their ancestral memory; Atlas frames on Sparr are the heirlooms of great warriors, tied to family (blood and chosen) and maintained by hand. Each suit on Sparr bears the history of its previous pilots in both decorations and FCA-compliant machine learning, which enables Sparri hunters to almost literally call upon their ancestors in battle. The Atlas has become so popular among the Sparri that they even developed a new martial art based on the Atlas: Jäger Kunst. </p> <p>The Karrakin nobility, on the other hand, find the Atlas to be a perfect machine for noble heroism &ndash; that the Sparri have an affinity for it only makes the chassis that much more desirable among Karrakin Sparrist scholars. Commonly decorated with purchased Sparri saga discs, Vast pelts, and saga lines, Karrakin suits blend imagined profiles of Annorum Passacaglia and Annorum Tyrannus-era heroes with profiles of Sparri warriors, daredevils, vast-hunters, and espadas.</p>",
      "mounts": [
        "Flex",
        "Main"
      ],
      "stats": {
        "size": 0.5,
        "stress": 4,
        "structure": 4,
        "armor": 0,
        "hp": 6,
        "evasion": 12,
        "edef": 6,
        "heatcap": 4,
        "repcap": 2,
        "sensor_range": 3,
        "tech_attack": -2,
        "save": 10,
        "speed": 6,
        "sp": 5
      },
      "traits": [
        {
          "name": "Giantkiller",
          "description": "The Atlas counts as SIZE 1 for RAM and GRAPPLE. It ignores engagement from larger characters and can freely move through and share the spaces they occupy (even if they’re hostile). While occupying the same spaces as any character, it gains soft cover, even from that character.",
          "synergies": [
            {
              "locations": [
                "ram",
                "grapple"
              ],
              "detail": "The Atlas counts as size 1 for the purposes of ramming and grappling."
            },
            {
              "locations": [
                "active_effects"
              ],
              "detail": "The Atlas ignores engagement from actors larger than itself, can share space with larger actors (even hostile ones) and move through their spaces unimpeded. While sharing space with any character, it gains soft cover, even from that character."
            }
          ]
        },
        {
          "name": "Jäger Dodge",
          "description": "1/round, when you take damage from a larger character, gain RESISTANCE to that damage and move 3 spaces in any direction as a reaction. This ignores engagement and doesn’t provoke reactions.",
          "actions": [
            {
              "name": "Jäger Dodge",
              "activation": "Reaction",
              "trigger": "You take damage from a character larger than yourself",
              "detail": "Gain resistance to that damage and move 3 spaces in any direction, ignoring engagement and reactions."
            }
          ]
        },
        {
          "name": "Finishing Blow",
          "description": "1/round, deal +1d6 bonus damage on a successful melee attack against a PRONE target.",
          "synergies": [
            {
              "locations": [
                "weapon"
              ],
              "weapon_types": [
                "Melee"
              ],
              "weapon_sizes": [
                "any"
              ],
              "detail": "1/round, the Atlas can deal +1d6 bonus damage with a successful melee attack against a prone target."
            }
          ]
        },
        {
          "name": "Exposed Reactor",
          "description": "The Atlas receives +1 Difficulty on ENGINEERING checks and saves.",
          "synergies": [
            {
              "locations": [
                "engineering",
                "skill_check"
              ],
              "detail": "The Atlas takes +1 difficulty on Engineering checks and saves."
            }
          ]
        }
      ],
      "core_system": {
        "name": "BLOODLINE Active Assist",
        "description": "The ATLAS extends microneedles into the musculature and ancillary nervous system of its pilot, melding flesh, machine, and the memory of all who wore it before.",
        "active_name": "Final Hunt",
        "active_effect": "<p>For the rest of the scene, you:</p> <ul> <li>Move an additional 1 space when you voluntarily move for any reason (e.g. standard moves, BOOST, movement from systems or talents).</li> <li>Benefits from soft cover at all times, no matter where you are.</li> <li>Can HIDE even in the open, without requiring cover.</li> </ul> <p> The only way to reveal you is for another character to SEARCH for you or for you to lose Hidden as usual &ndash; by using BOOST, attacking, forcing a save, and so on. When active, 1/round, when you make a melee or ranged attack while HIDDEN, your target must also succeed on a HULL save or be knocked PRONE. This takes place before the attack is rolled </p>",
        "activation": "Quick"
      },
      "image_url": "https://d2c79xe1p61csc.cloudfront.net/frames/mf_atlas.png",
      "license_id": "mf_atlas"
    },
    {
      "id": "mf_caliban",
      "source": "IPS-N",
      "name": "Caliban",
      "mechtype": [
        "Striker",
        "Controller"
      ],
      "license_level": 2,
      "y_pos": 12.5,
      "description": "<p>The Caliban chassis is a popular new order among anti piracy and stellar marine forces. Unlike many of IPS-N's modern frames, the Caliban was designed from the ground up to be a military machine. </p> <p>The Caliban is IPS-N's solution to the  \"Yemanova \" Problem, more properly known as the Impact-Override Problem. Capital ships, the problem posits, are incredibly expensive, demand a tremendous amount of time for corpros and Diasporan states to produce and maintain, and increasingly outmatched by anti-ship weaponry. In a conventional capital duel, a successful kill means the death of thousands of personnel and the loss of millions of units of manna; this makes many commanders gun-shy, encouraging them to rely on subline vessels and fighters to accomplish battle objectives rather than risk their big ships. This strategy tends to prove just as expensive: instead of one or a handful of large ships being destroyed, signifying the end of a battle, engagements can grind on for weeks as squadrons of smaller ships engage inside the unpredictability gap, inching towards victory. </p> <p>IPS-N was the first to crack the Yemanova Problem. The corpro's designers identified the need for a rapidly deployable, sub-signature, directed weapon. It needed to be well-armed and well-armored, small enough to enter a ship and efficiently neutralize personnel in order to achieve victory. IPS-N created the Caliban to solve this need. </p> <p>Cultural critics argue that mechanized chassis venerate the form of a particular humanity; it is an unconscious nod towards the anthrochauvinist roots of the machine among leading designers and fabricators. The Caliban is not that. It was never intended to be an image of man writ large, striding across the battlefield heroically to affect a greater purpose. </p> <p>Unlike many IPS-N frames, the Caliban has no roots in early attempts at self-defense by freighter crews and asteroid miners. It was not born from ingenuity - there is no legacy of resilience, heroism, or the frontier spirit to paper over the purpose of its birth. It has no civilian applications in aid, disaster relief, construction, or farming; it does not build, defend, or inspire &ndash; it was designed to solve a numbers problem on a ledger. </p> <p>It is a tool designed to kill human beings very, very quickly. </p>",
      "mounts": [
        "Heavy"
      ],
      "stats": {
        "size": 0.5,
        "structure": 4,
        "stress": 4,
        "armor": 2,
        "hp": 6,
        "evasion": 8,
        "edef": 8,
        "heatcap": 5,
        "repcap": 5,
        "sensor_range": 3,
        "tech_attack": -2,
        "save": 11,
        "speed": 3,
        "sp": 5
      },
      "traits": [
        {
          "name": "Wrecking Ball",
          "description": "The Caliban counts as Size 3 when inflicting knockback with any Ram, Ranged, or Melee Attack.",
          "synergies": [
            {
              "locations": [
                "weapon"
              ],
              "weapon_types": [
                "any"
              ],
              "weapon_sizes": [
                "any"
              ],
              "detail": "The Caliban counts as size 3 when inflicting knockback from any ranged or melee attack."
            }
          ]
        },
        {
          "name": "Pursue Prey",
          "description": "When the Caliban inflicts KNOCKBACK as part of any action, it can move an equal number of spaces towards the same target by the most direct route possible. This movement is part of the same action, ignores engagement and doesn’t provoke reactions."
        },
        {
          "name": "Slam",
          "description": "1/round, when the Caliban knocks a character into a wall, mech, or other obstruction that would cause it to stop moving, it may force its target to pass a HULL save or take 1d6 Kinetic Damage and become IMPAIRED until the end of its next turn."
        },
        {
          "name": "Weak Computer",
          "description": "The Caliban takes +1 Difficulty on all SYSTEMS saves and checks.",
          "synergies": [
            {
              "locations": [
                "systems",
                "skill_check"
              ],
              "detail": "The Caliban takes +1 Difficulty on all systems saves and checks"
            }
          ]
        }
      ],
      "core_system": {
        "name": "Flayer Shotgun",
        "description": "The “Flayer” – officially the Heavy Howitzer-Shotgun 075 – is a compact, formalized version of the popular “Daisy Cutter” howitzer-shotgun used by Trunk Security and other stellar marine forces. Chambered to accept shot, shell, or sabot, the Flayer sacrifices some of the DaisyCutter’s raw power in favor of control and a much-improved fire rate.",
        "active_name": "Equip Autochoke",
        "active_effect": "The Flayer shotgun comes pre-equipped with a muzzle-mounted auto-choke that allows its user to better define the spread of shot issuing from the weapon. The extreme heat from equipping the choke renders it unusable in short order and it must be discarded.<br>For the rest of this scene, the HHS-075 “Flayer” Shotgun gains the following profile:<br>Main CQB, Accurate, Knockback 5<br>[Cone 3] [Threat 3] [1d6+2 kinetic damage]",
        "activation": "Protocol",
        "integrated": [
          "mw_caliban_integrated"
        ]
      },
      "image_url": "https://d2c79xe1p61csc.cloudfront.net/frames/caliban.png",
      "license_id": "mf_caliban"
    },
    {
      "id": "mf_kobold",
      "source": "HORUS",
      "name": "Kobold",
      "mechtype": [
        "Controller"
      ],
      "y_pos": 25,
      "license_level": 2,
      "description": "<p>The Kobold pattern group first appeared among revolutionary Ungratefuls toiling on Bo, the capital world of the House of Dust, where it manifested as a clever suite of hardware and software compatible with a broad range of mining and heavy industry mechs. The steaming, shuddering final result of K-PG exposure is an ugly affair: a device transformed from plow to blade by powerful, viral-morph liturgicode that is almost impossible for conventional codec sniffers to capture pre-print. </p> <p>The clandestine mechanisms by which the Kobold is transmitted and applied make it the perfect machine for fighting Baronic suppression forces. The desperate workers who printed the first Kobolds found them to be eminently fungible. When loaded into their mining exos and chassis, the K-PG code repurposed reactors and industrial tools to deadly effect, weaponizing the very materials and superstructures that powered it. The rapid flash-melting, processing, and extruding of raw material into molten plural-state particles is dangerous &ndash; often just as dangerous to its pilot as the final product is to its targets. </p> <p>Operational dangers notwithstanding, the Ungratefuls who first adopted the K-PG stunned their Baronic overseers with a series of rapid and total victories, liberating a great swath of lunar helium-3 mines. While the insurgency was eventually contained to Bo, it continues, necessitating the deployment of the House of Dust's Graveborn Banner Company for counter-insurgency operations beyond the capability of local security forces. </p> <p>HORUS's assets in the Long Rim continue to produce K-PG liturgicode seeds. The House of Dust has contracted Mastodon to track down and eliminate HORUS elements in the area; meanwhile, Harrison Armory has reached out to the Brigade-Legion to counter the House of Dust's efforts. </p>",
      "mounts": [
        "Main/Aux"
      ],
      "stats": {
        "size": 0.5,
        "stress": 4,
        "structure": 4,
        "armor": 1,
        "hp": 6,
        "evasion": 10,
        "edef": 10,
        "heatcap": 6,
        "repcap": 2,
        "sensor_range": 8,
        "tech_attack": 1,
        "save": 11,
        "speed": 4,
        "sp": 8
      },
      "traits": [
        {
          "name": "Mimic Carapace",
          "description": "When the Kobold starts its turn adjacent to a piece of terrain or hard cover of SIZE 1 or larger it becomes INVISIBLE as long as it remains adjacent. It ceases to be INVISIBLE if it attacks or takes damage."
        },
        {
          "name": "Slag Spray",
          "description": "1/round, as a quick action, the Kobold may create a SIZE 1 mound of semi-molten polymer in a free space within Range 3 and line of sight. This terrain has 10 HP, EVASION 5, and grants hard cover.",
          "deployables": [
            {
              "name": "Slag Spray",
              "type": "Deployable",
              "size": 1,
              "hp": 10,
              "evasion": 5,
              "activation": "Quick",
              "detail": "This semi-molten polymer grants hard cover."
            }
          ]
        },
        {
          "name": "Exposed Reactor",
          "description": "The Kobold gets +1 Difficulty on ENGINEERING checks and saves.",
          "synergies": [
            {
              "locations": [
                "engineering",
                "skill_check"
              ],
              "detail": "The Kobold takes +1 difficulty on Engineering checks and saves."
            }
          ]
        }
      ],
      "core_system": {
        "name": "Terraform",
        "description": "Screeching and venting steam, the Kobold digs into the earth. Moments later, the very ground bends to the pilot’s will and the air shrieks with agony — the cry of every dead Ungrateful, martyred or taken by the Dustmen",
        "active_name": "Terraform",
        "active_effect": "Your mech extrudes a massive amount of polymer, creating up to 10 SIZE 1 cubes in free spaces within Range 5. These cubes can be separate or connected and can be stacked up to 5 spaces high. If connected, they form a contiguous surface that can block line of sight. During the turn in which they are extruded, the cubes grant soft cover and each has EVASION 5 and 10 HP. At the start of your next turn, they harden, each cube granting hard cover and gaining +10 HP (but retaining any damage they had taken).",
        "activation": "Full"
      },
      "image_url": "https://d2c79xe1p61csc.cloudfront.net/frames/mf_kobold.png",
      "license_id": "mf_kobold"
    },
    {
      "id": "mf_lich",
      "source": "HORUS",
      "name": "Lich",
      "mechtype": [
        "Support"
      ],
      "license_level": 2,
      "y_pos": 8,
      "description": ">//TRANSCRIPT: M.A2_Recovered[UIB:::TERMAGANT]<br>>//TANGENT ROYAL CLEARANCE<br>>//checking…<br>>//TRC_ACCEPTED. OPEN DOC:::Y<br>>//BEGIN:::<br>CALIGULA: So what is it?<br>DOGFRIEND_68: i wish i could tell you, man, it just showed up on the terminal. whole thing in one ping — it’s like a fucking K or two EXB. tried to autofab but i shut it down jic<br>CALIGULA: Gotta be a joke from Ash — she’s trying to wavedown our rig again, don’t let it print.<br>DOGFRIEND_68: fuck no<br>DOGFRIEND_68: do u think i have a death wish<br>CALIGULA: Yes.<br>CALIGULA: Well, who’s it from? Who’s the author?<br>CALIGULA: Hello?<br>CALIGULA: [waiting.omif]<br>DOGFRIEND_68: uh<br>CALIGULA: Who?<br>DOGFRIEND_68: us<br>CALIGULA: Us what?<br>DOGFRIEND_68: it’s from our terminal — we made it<br>CALIGULA: Pretty sure I’d remember if I wrote 1-2k exabyte fabrication by myself.<br>DOGFRIEND_68: yeah except thats our code man, the hash lines up beaucop-sigma<br>DOGFRIEND_68: ok also BigMama is telling me we didn’t actaully get anything inbound which means its just been local but thats impossible, we don’t have that much storage<br>CALIGULA: Let me see the file<br>CALIGULA: It’s dated 15005U<br>DOGFRIEND_68: [lolfuk.omif]<br>CALIGULA: There’s an audio track buried in here. Should I play it?<br>DOGFRIEND_68: i wanna say no but fuck it i’m curious<br>>//TRANSCRIPT ENDS",
      "mounts": [
        "Main/Aux"
      ],
      "stats": {
        "size": 1,
        "structure": 4,
        "stress": 4,
        "armor": 0,
        "hp": 4,
        "evasion": 8,
        "edef": 12,
        "heatcap": 3,
        "repcap": 5,
        "sensor_range": 15,
        "tech_attack": 1,
        "save": 11,
        "speed": 5,
        "sp": 8
      },
      "traits": [
        {
          "name": "Soul Vessel",
          "description": "At the start of the Lich's turn, set down a SOUL VESSEL at its current location (replacing any previous markers). 1/round, as a reaction when the Lich is hit by an attack, fails a save or check, or takes damage or Heat from any source (even itself), it may immediately gain IMMUNITY to all damage, heat, or conditions from that effect. It then teleports to the marker or as close as possible. The Lich can also take this reaction at the end of any turn, including its own, but if it does so it only teleports and does not gain IMMUNITY. It can't take this reaction if it is JAMMED, STUNNED, GRAPPLED, or unable to take reactions for any reason."
        },
        {
          "name": "Immortal",
          "description": "1/scene, in the round after the Lich has been destroyed, it may return to the location of its SOUL VESSEL as a reaction at the end of any turn. This counts as teleporting; additionally, the Lich appears with full HP, no Heat, 1 STRUCTURE and 1 STRESS (even if it had more when it was destroyed). If its pilot died in the same scene, they also return to life. If the Lich does not take this reaction in that round, it remains destroyed and the pilot remains dead."
        }
      ],
      "core_system": {
        "name": "Chronostutter",
        "description": "“Drink Deep, and Descend.”",
        "active_name": "Glitch time",
        "active_effect": "<p>You gain the ability to disrupt time for the rest of this scene. 1/round, when any character successfully attacks, effects, or takes an action against another character within SENSORS, you may interrupt it before it resolves, with the following effects:</p> <ul> <li>The character taking the action is pushed up to 3 spaces in a direction of your choice, even if they have IMMUNITY to involuntary movement</li> <li>You teleport to one of the spaces originally occupied by that character, or as close as possible, no matter how far away it was.</li> <li>The initial attack, effect, or action resolves with you as its target. </li> </ul> <p>You receive all damage, conditions, statuses, and effects, and the action must be carried out without changes. For example, if the effect was to teleport an allied character to a certain space, you are teleported to that space instead; if the effect was to repair an allied character, you are repaired instead; if the effect was to deal damage and KNOCKBACK, you take the damage (using your ARMOR, RESISTANCE, etc.) and are knocked back in the same direction as the original target would be; if the effect was to inflict a condition or status, you receive that condition or status instead. Initiating this interruption does not count as a reaction. Effects that target the self cannot be interrupted this way </p>",
        "activation": "Quick"
      },
      "image_url": "https://d2c79xe1p61csc.cloudfront.net/frames/mf_lich.png",
      "license_id": "mf_lich"
    },
    {
      "id": "mf_sunzi",
      "source": "HA",
      "name": "Sunzi",
      "mechtype": [
        "Support",
        "Controller"
      ],
      "license_level": 2,
      "y_pos": 23,
      "description": "<p>The Sunzi represents the peak of Harrison Armory's research into weaponized blink technology. Pilots approved to fabricate and field-test Sunzi components are monitored remotely by the Armory's Special Projects Group, which enjoys wide latitude in gathering telemetry and biometric data. The Sunzi platform is considered by Harrison Armory to still be in development, and not yet available for fleet contracts. </p> <p>Like the Armory's Napoleon chassis before it, the Sunzi utilizes the Armory's H-GOBLIN-derived recursive-mesh interdermal substrate, allowing it to mount outsized weapons and systems on a chassis measuring just over three meters tall. Where it differs is in its technological heritage. The Napoleon was largely the product of the Armory's internal paracausal/ parallel space research and development groups; the Sunzi is rumored to be derived from stolen and extracted Volador technology. This may explain why the Long Rim and the Dawnline Shore are the primary test grounds for the platform &ndash; far from Union's most direct oversight, the Armory may have more time to make what progress it can before Union's regulatory impulse catches up to them. </p> <p>According to Union NavInt reports on the Sunzi, the platform's unshielded emissions are consistent with known blinkspace signatures; corroborating intelligence from undercover elements inside the program's main campus on Ras Shamra show that the Sunzi's development has been fast-tracked to respond to the evolving situation in the Dawnline Shore. Both as a forcemultiplication tool to assist the Armory's legionary presence across the Shore, and more specifically to counter the Ungratefuls' newest weapon there, Object L (see UNI Report CORPSE GATE for more). </p>",
      "mounts": [
        "Main/Aux"
      ],
      "stats": {
        "size": 1,
        "armor": 1,
        "stress": 4,
        "structure": 4,
        "hp": 7,
        "evasion": 7,
        "edef": 8,
        "heatcap": 7,
        "repcap": 3,
        "sensor_range": 15,
        "tech_attack": 1,
        "save": 11,
        "speed": 4,
        "sp": 7
      },
      "traits": [
        {
          "name": "Safe Harbor",
          "description": "When allied characters within Range 50 of the Sunzi teleport or are teleported, free spaces adjacent to the Sunzi are always valid end destinations."
        },
        {
          "name": "Anchor",
          "description": "The Sunzi has Immunity to involuntary movement caused by other characters."
        },
        {
          "name": "Slip",
          "description": "1/round, the Sunzi can teleport 2 spaces as a free action.",
          "actions": [
            {
              "name": "Slip",
              "frequency": "1/Round",
              "activation": "Free",
              "detail": "1/round the Sunzi can teleport 2 spaces as a free action"
            }
          ]
        }
      ],
      "core_system": {
        "name": "Reality Carver",
        "description": "(TT_CLEARANCE_01): JUST A HEADS UP, YOU’RE GOING TO READ SOME OBTUSE SHIT HERE. I’VE TRANSCRIBED ONLY THE USEFUL PARTS OF WHAT THE VOLS SAID. REFER TO THE VISUAL FOR CORRESPONDING HAND SIGNS. REFER TO REPORTS: VESSEL-PILOT-DOORWAY",
        "active_name": "Art of War",
        "activation": "Free",
        "active_effect": "For the rest of the scene, this system gains 6 charges (you can use a die to track this). As a reaction at the start or end of any hostile or allied character’s turn within SENSORS and line of sight, expend a charge to teleport them up to 3 spaces in any direction, as long as they end in a free space in which they can stand.",
        "passive_name": "Blink Anchor",
        "passive_effect": "Blink Anchor (SIZE 1/2, Tags: DEPLOYABLE, IMMUNITY to all damage and effects, LIMITED 3)<br>You carry a single blink anchor that you can deploy as a quick action. When any character teleports within your line of sight, you may force them to appear in a free space adjacent to the blink anchor instead of their original destination, as long as they can safely stand there. If your target is hostile, this expends a charge.<br>Initiating this interruption does not count as a reaction. Once it’s deployed, you or any allied character can pick it up or put it down while adjacent to it as a quick action.",
        "counters": [
          {
            "id": "ctr_art_of_war",
            "name": "Art of War",
            "default_value": 6,
            "min": 0,
            "max": 6
          }
        ]
      },
      "image_url": "https://d2c79xe1p61csc.cloudfront.net/frames/mf_sunzi.png",
      "license_id": "mf_sunzi"
    },
    {
      "id": "mf_zheng",
      "source": "IPS-N",
      "name": "Zheng",
      "mechtype": [
        "Striker"
      ],
      "license_level": 2,
      "y_pos": 30,
      "description": "<p>The Zheng is a new frame in IPS-N's line and is unusual in that its development can be attributed almost completely to a single mech pilot &ndash; Xiong Xiaoli, a Mirrorsmoke mercenary operating in the Long Rim, protecting heavy freight/low crew shipments to the early Dawnline Shore colonies. A relative unknown before the incident, MSMC documentation from the time indicates that her convoy was attacked by the White Tiger pirate conglomerate, and her entire company killed in action. Xiong's personal logbook, recovered posthumously, expounds on MSMC's report. </p> <p>In her logbook, Xiong noted that her chassis, a factory-standard IPS-N Raleigh, was almost totally ripped apart in the chaos of the White Tiger's attack. Thrown free of her billeted freighter after it collided with a White Tiger crashboat, Xiong managed to survive the next 45 days by scavenging across the drifting, derelict wreck of the MSMC-S Say No More, the escort cruiser attached to the supply colony. Outnumbered and hunted by the White Tiger pirates prowling the ruined convoy, Xiong took dramatic steps to modify her Raleigh for close-quarters combat. In the dark, claustrophobic environments of the Say No More and ruined freighters leashed to it by the White Tigers, Xiong turned her chassis into a machine of tumbling death. </p> <p>Xiong likely did not survive the long engagement. She is presumed to have perished mere days before an IPS-N Trunk Security patrol arrived, responding to the convoy's initial distress signal. Trunk Security found that Xiong had eliminated every White Tiger pirate assigned to the convoy; her chassis, logbook, and trace elements of her body were discovered in the White Tiger's cored-out gunboat and recovered by IPS-N. Thanks to her efforts, Trunk Security and MSMC were able to hunt down the remaining White Tiger gang and eliminate them. IPS-N and MSMC then engaged in a lengthy negotiation over the modified Raleigh's plans, eventually settling on a mixed licensing fee that benefits both IPS-N and MSMC. The resulting pattern, the Zheng, is now a popular choice among MSMC and Trunk Security pilots operating across the Rim. </p> <p>Xiong Xiaoli is widely regarded as a bodhisattva across the Long Rim; MSMC mercenaries have created several drinking games named after her, and MSMC pilots on combat contracts often compete to hit the \"Xiong Limit\" of 45+ confirmed kills. </p>",
      "mounts": [
        "Main",
        "Main",
        "Heavy"
      ],
      "stats": {
        "size": 1,
        "structure": 4,
        "stress": 4,
        "armor": 2,
        "hp": 10,
        "evasion": 9,
        "edef": 6,
        "heatcap": 6,
        "repcap": 6,
        "sensor_range": 3,
        "tech_attack": -2,
        "save": 10,
        "speed": 3,
        "sp": 5
      },
      "traits": [
        {
          "name": "Destructive Swings",
          "description": "At the end of the Zheng’s turn, if it made at least one melee attack against a hostile character, the force of its swings creates a SIZE 1 piece of terrain that grants hard cover in a free, adjacent space. It has 10 HP and EVASION 5.",
          "deployables": [
            {
              "name": "Destructive Swing Cover",
              "type": "Deployable",
              "activation": "Free",
              "hp": 10,
              "evasion": 5,
              "size": 1,
              "detail": "This terrain grants hard cover"
            }
          ]
        },
        {
          "name": "Weak Computer",
          "description": "The Zheng takes +1 Difficulty on all systems saves and checks",
          "synergies": [
            {
              "locations": [
                "systems",
                "skill_check"
              ],
              "detail": "The Zheng gets +1 Difficulty on all Systems saves and checks"
            }
          ]
        }
      ],
      "core_system": {
        "name": "XIONG-Type CQB Suite",
        "description": "Surviving mostly on colonial rations and an increasingly radioactive air supply, Xiaoli scavenged materials from a dying ship to create modifications that gave her mech unprecedented unarmed striking power.",
        "active_name": "Xiaoli’s Ingenuity",
        "active_effect": "For the rest of the scene, this system gains 6 charges (you can use a die to track this). Expend a charge to use XIAOLI’S TENACITY again, ignoring the 1/Turn limit. You may spend any number of charges a turn. At the end of each turn, you regain a charge for each unique target (character, object, or piece of terrain) you damaged with this action, to a maximum of 6.",
        "activation": "Protocol",
        "passive_name": "Xiaoli's Tenacity",
        "passive_actions": [
          {
            "name": "Xiaoli's Tenacity",
            "activation": "Free",
            "detail": "1/turn as a free action, you may move up to 3 spaces then deal 2 Kinetic to any adjacent character or 10 Kinetic AP to an object or piece of terrain. This movement prompts engagement and does not ignore reactions.<br>If this damage destroys an object or piece of terrain, it explodes, dealing 1d6 Kinetic to all adjacent characters other than you and knocking them back 1 space."
          }
        ],
        "counters": [
          {
            "id": "ctr_xiaoli_type_cqb_suite",
            "name": "Xiaoli Die",
            "default_value": 6,
            "min": 0,
            "max": 6
          }
        ]
      },
      "image_url": "https://d2c79xe1p61csc.cloudfront.net/frames/mf_zheng.png",
      "license_id": "mf_zheng"
    }
  ],
  "lcp_manifest.json": {
    "name": "Lancer Long Rim Data",
    "author": "Massif Press",
    "description": "This setting expansion for Lancer features a wealth of information on the Long Rim sector of space, including: Two new talents, Spaceborn, and Black Thumb for pilots who want to excel in null-gravity combat, and access to six additional mechs to pilot, in addition to their unique gear: The proud, memory-driven ATLAS, favored by Sparri espadas and Karrakin knights; The resourceful KOBOLD, the messy face of liberation for many across Baronic space; The storied ZHENG, the chassis first crafted by the bodhisattva-saint Xiong Xiaoli; The brutal CALIBAN, IPS-N's new corridor-clearing chassis designed specifically for boarding actions; The Harrison Armory SUNZI, a battlefield manipulator built from stolen Volador tech; and the deathless LICH, a timeless entity released from blinkspace to haunt our reality.",
    "item_prefix": "msf-tlr-",
    "version": "1.2.1",
    "image_url": "https://img.itch.zone/aW1hZ2UvNTY3MjM4LzI5OTU1NjMuanBn/347x500/wib3ez.jpg",
    "website": "https://massif-press.itch.io/the-long-rim"
  },
  "mods.json": [
    {
      "id": "wm_supermassive_mod",
      "name": "Supermassive Mod",
      "sp": 1,
      "allowed_types": [
        "Melee",
        "CQB",
        "Cannon"
      ],
      "source": "IPS-N",
      "license": "Caliban",
      "license_level": 1,
      "effect": "Choose one CQB, CANNON, or MELEE weapon: it gains OVERKILL and KNOCKBACK +1. During a FULL REPAIR, you may tune it to remove safety limiters, increasing this benefit to KNOCKBACK +2 instead; however, it also gains ORDNANCE (if it is ranged) or INACCURATE (if it is melee).",
      "description": "The first in a suite of best-practice modifications for close-quarters combat out of the same Titan–Enceladus Field Project that produced the Caliban, supermassive mods include a host of alterations to close-quarters weapons designed to enhance their general lethality and utility by lifting safety precautions.",
      "tags": [
        {
          "id": "tg_unique"
        }
      ],
      "added_tags": [
        {
          "id": "tg_overkill"
        },
        {
          "id": "tg_knockback",
          "val": 1
        }
      ],
      "license_id": "mf_caliban"
    },
    {
      "id": "wm_molten_wreathe",
      "name": "Molten Wreathe",
      "sp": 2,
      "allowed_types": [
        "Melee"
      ],
      "source": "IPS-N",
      "license": "Zheng",
      "license_level": 2,
      "effect": "Choose one MELEE weapon: 1/round, after you hit a character with this weapon, you take 1 Heat and it projects a superheated Cone 3 cloud oriented away from your target in a direction of your choice. Your target and any characters caught in this cloud each take 2 Explosive Damage.",
      "description": "Needing a significant boost to her Raleigh’s melee capacity, Xiong decided upon a crude but effective solution: she would re-route her Raleigh’s coldcore dispersion systems into the chassis’ palms with a simple on/off switch, allowing it to superheat equipped weapons. The resultant ad hoc thermal weapon is so hot that it prompts an explosive vaporization of hard and soft surfaces on impact, creating a secondary backblast cloud that is a deadly weapon in its own right. The production version of this system simply adds a sturdier, dedicated routing system and better insulation.",
      "license_id": "mf_zheng"
    }
  ],
  "systems.json": [
    {
      "id": "ms_multi_gear_maneuver_system",
      "name": "Multi-Gear Maneuver System",
      "type": "System",
      "sp": 1,
      "tags": [
        {
          "id": "tg_unique"
        }
      ],
      "source": "SSC",
      "license": "Atlas",
      "license_level": 1,
      "actions": [
        {
          "name": "Fire Zip Line",
          "activation": "Quick",
          "detail": "You fire a zip line 8 spaces long that connects 2 free spaces in line of sight, one of which must be adjacent to you. Both ends must be attached to a surface, such as a wall or floor. It activates at the end of your turn with the following benefits: <ul> <li>Size 1/2 characters that are adjacent to either end of the line can move to the other end as a quick action as long as they are able to grab onto it. They can hop off at any point along the line if they wish. </li> <li>Whenever Size 1 or larger characters cross the space occupied by the line for the first time in a round or start their turn within one, they must succeed on an Agility save or fall Prone. </li> </ul>Any character adjacent to the start or endpoint of the line can tear the line down by succeeding on a Hull check as a quick action or by successfully performing a melee attack against either end. The line has 1 HP and Evasion 10. Destroying the zip line in this way does not destroy this system. Otherwise, the line lasts until you use this system again."
        }
      ],
      "description": "Used by Sparri hunters to bridge the vast gaps in the ice sheet that cover their world, this system is in high demand among daredevils and thrill-seekers across the planet.",
      "license_id": "mf_atlas"
    },
    {
      "id": "ms_jäger_kunst_i",
      "name": "Jäger Kunst I",
      "type": "System",
      "sp": 2,
      "tags": [
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_heat_self",
          "val": 1
        }
      ],
      "source": "SSC",
      "license": "Atlas",
      "license_level": 2,
      "actions": [
        {
          "name": "Jäger Kunst I",
          "activation": "Protocol",
          "detail": "For the rest of the turn, any time you move adjacent to an object or free-standing piece of terrain larger than you, you move 2 spaces in any direction as a free action, ignoring engagement and reactions, running, tumbling, or sliding around. You can do this multiple times a turn, but only once for each unique object or piece of terrain."
        }
      ],
      "description": "Based on earlier hardsuit martial arts, Jäger Kunst pushes the form beyond human parameters, enabling actions and motions faster than human thought. Many Atlas suits can be printed with a suite of combat forms already enabled, although letting the chassis perform these movements without the user first learning them can lead to catastrophic self-injury"
    },
    {
      "id": "ms_ricochet_blades",
      "name": "Ricochet Blades",
      "type": "System",
      "sp": 3,
      "tags": [
        {
          "id": "tg_limited",
          "val": 3
        },
        {
          "id": "tg_unique"
        }
      ],
      "source": "SSC",
      "license": "Atlas",
      "license_level": 2,
      "actions": [
        {
          "name": "Throw Ricochet Blade",
          "activation": "Quick",
          "detail": "As a quick action, you throw a ricochet blade along a line 3 path, dealing 2 Kinetic Damage to all characters within the affected area. If the initial line reaches a piece of terrain or object of Size 1 or larger, draw another line 3 path from that object in a new direction that doesn't overlap with the object it ricocheted off. Characters within the affected area must succeed on an Agility save or take 1d6+3 kinetic damage."
        }
      ],
      "description": "These disc-shaped blades are designed, produced, and hand-finished by SSC’s Toledo blade enclave. The material is flexible enough to bounce when striking against surfaces but sharp enough to slice bone and metal. Unlike the edged weapons made by the more restrictive Terashima enclave, the Toledo enclave produces these weapons with the expectation that they’ll be used and discarded. This does not impact their quality but does lead to supply shortages from time to time – this exclusivity is intentional. Due to their comparative rarity, Toledo discs are often used as currency by Sparri espadas; their use in combat or hunting is a mark of status.",
      "license_id": "mf_atlas"
    },
    {
      "id": "ms_jäger_kunst_ii",
      "name": "Jäger Kunst II",
      "type": "System",
      "sp": 3,
      "tags": [
        {
          "id": "tg_limited",
          "val": 3
        },
        {
          "id": "tg_unique"
        }
      ],
      "source": "SSC",
      "license": "Atlas",
      "license_level": 3,
      "actions": [
        {
          "name": "Fatal Clash",
          "activation": "Reaction",
          "frequency": "1/round",
          "trigger": "You take damage from or deal damage with a melee attack",
          "detail": "After damage has been resolved, you and your target each roll a contested Hull or Agility check (each party choosing which to roll). The loser is knocked Prone, takes 1d6 kinetic damage, and is knocked back 3 spaces in a direction chosen by the winner. The winner may then move 3 spaces in any direction, ignoring engagement and not provoking reactions. The loser may immediately take 2 AP kinetic damage to force the contest to be rerolled. This damage cannot be prevented or reduced in any way.<br>If the result is a tie, the contest immediately ends. Otherwise, the contest continues until one character loses without forcing a re-roll or would take structure damage, in which case they immediately lose."
        }
      ],
      "description": "The rarest of Atlas frames can be printed with the embedded muscle memories of Jäger Kunst masters: old Sparri and others who have dedicated lives to their martial art. SSC does not recommend using these embedded systems without proper bodily tempering and will not release these programs to unqualified pilots.",
      "license_id": "mf_atlas"
    },
    {
      "id": "ms_hardpoint_reinforcement",
      "name": "Hardpoint Reinforcement",
      "type": "Shield",
      "sp": 2,
      "tags": [
        {
          "id": "tg_shield"
        }
      ],
      "source": "IPS-N",
      "license": "Caliban",
      "license_level": 2,
      "effect": "As long as you are not Slowed or Immobilized, you gain Resistance to all damage during your turn.",
      "description": "Also developed in IPS-N’s ongoing Titan–Enceladus Field Project, hardpoint reinforcement systems further strengthen frames, ensuring an across-the-board increase in Caliban chassis TTK.",
      "license_id": "mf_caliban"
    },
    {
      "id": "ms_spike_charges",
      "name": "Spike Charges",
      "type": "Deployable",
      "sp": 2,
      "tags": [
        {
          "id": "tg_limited",
          "val": 2
        },
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_grenade"
        }
      ],
      "source": "IPS-N",
      "license": "Caliban",
      "license_level": 2,
      "actions": [
        {
          "name": "Spike Grenade",
          "activation": "Quick",
          "detail": "Throw a Spike Grenade at a target within Range 5. Your target must pass an Agility save or the grenade attaches to them and arms itself. It automatically attaches to objects. At the start or end of any turn, while a spike grenade is attached, you may detonate all armed spike grenades as a reaction. Characters to whom they are attached take 1d6+3 kinetic damage and are knocked back 3 spaces in a direction of your choice, while objects just take the damage. Characters can detach spike grenades from themselves by passing another Agility save as a quick action on their turn. All grenades detach at the end of the scene."
        }
      ],
      "deployables": [
        {
          "name": "Spike Mine",
          "activation": "Quick",
          "type": "Mine",
          "range": [
            {
              "type": "Burst",
              "val": 2
            }
          ],
          "detail": "Once activated, characters within a Burst 2 must pass an Agility save or a spike grenade attaches itself to them as described above."
        }
      ],
      "description": "Originally designed as a load variant for use with the Hammer U-RPL, spike charges carry dozens of hardened flechettes designed to tumble, ricochet, and pierce upon shell detonation, tearing apart flesh and soft targets with sheer torque. As a payload for impact-activated grenades and proximity-activated mine, these devices found their use first in micro/null-grav combat, in which out-ofcontrol vessels and units could themselves be turned into missiles. In gravity-well combat, this system is less deadly but no less chaotic.",
      "license_id": "mf_caliban"
    },
    {
      "id": "ms_rapid_maneuver_jets",
      "name": "Rapid Maneuver Jets",
      "type": "System",
      "sp": 4,
      "tags": [
        {
          "id": "tg_overshield"
        },
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_heat_self",
          "val": 1
        }
      ],
      "source": "IPS-N",
      "license": "Caliban",
      "license_level": 3,
      "effect": "1/round, when you Boost, you fly, gain Overshield 3, and ignore engagement from and may freely pass through spaces occupied by larger characters (but not end your turn in their spaces). You must end this movement in a space on which you can stand, or else you fall.",
      "synergies": [
        {
          "locations": [
            "boost"
          ],
          "detail": "1/round, when you Boost, you fly, gain Overshield 3, and ignore engagement from and may freely pass through spaces occupied by larger characters (but not end your turn in their spaces). You must end this movement in a space on which you can stand, or else you fall."
        }
      ],
      "description": "Further streamlining and miniaturizing IPS-N’s Ramjet system, IPS-N’s new RMJ frame-volatility package increases a chassis’ control envelope, ensuring its pilot can maintain enhanced mobility at pace. This control, coupled with a raw increase in speed, makes any chassis far more difficult to successfully engage.",
      "license_id": "mf_caliban"
    },
    {
      "id": "ms_forge_clamps",
      "name": "Forge Clamps",
      "type": "System",
      "sp": 1,
      "source": "HORUS",
      "license": "Kobold",
      "license_level": 1,
      "actions": [
        {
          "activation": "Quick",
          "detail": "You sink the jaws of your clamp into an adjacent object or piece of terrain of Size 1 or larger. You become Immobilized but gain Immunity to Knockback and Prone. This effect ends if the thing you’re clamped onto is destroyed or if you release the clamp as a protocol."
        }
      ],
      "description": "Repurposed from polycrete foundry tongs, these simple manipulators are incredibly resistant to heat and deformation. Using the KOBOLD protocols, previously inert forge clamps become the adherent surfaces for thin plasma sheaths; like blades, they can shear through armor, earth, or bulkhead with ease. One common tactic involves “flashing” plasma across the clamps, fusing them to their target until the Kobold pilot “flashes” them free.",
      "license_id": "mf_kobold"
    },
    {
      "id": "ms_seismic_pulse",
      "name": "Seismic Ripper",
      "type": "System",
      "sp": 2,
      "source": "HORUS",
      "license": "Kobold",
      "license_level": 2,
      "actions": [
        {
          "activation": "Full",
          "detail": "You unleash a seismic pulse in a line 10 path: characters in the affected area must pass a Hull save or be knocked Prone and all objects and pieces of terrain automatically take 10 AP energy damage. If this destroys a piece of terrain or object, it explodes with a Burst 1 area. Characters caught in the area of exploding terrain or objects must pass an Agility save or take 2d6 explosive damage. If they pass, they take half damage. Each character can only be affected by one of these explosions at a time, even if several overlap."
        }
      ],
      "description": "A deadly weapon created from simple shaped charges – the perfect catalyst for insurrection. Easily obtained and disguised as necessary equipment for blast-mining, charges rigged to produce a linear seismic pulse were common in the early days of Ungrateful activity. As Baronic security adapted their strategies, so too did the Ungratefuls; now, these once-simple explosive devices are much more complex – harder to detect, and far more deadly.",
      "license_id": "mf_kobold"
    },
    {
      "id": "ms_purifying_code",
      "name": "Purifying Code",
      "type": "System",
      "sp": 2,
      "source": "HORUS",
      "license": "Kobold",
      "license_level": 3,
      "actions": [
        {
          "name": "FLAW_plus",
          "activation": "Invade",
          "detail": "You inject a memetic, proximity based virus into the target’s reactor. At the end of their next turn, if they are not adjacent to another character or piece of terrain of Size 1 or larger, the virus catalyzes and they take 1d6+2 AP explosive damage. Once catalyzed, the effect ends.<br>A character can only be affected by one Purifying Code option at a time and are aware of their effects."
        },
        {
          "name": "FLAW_minus",
          "activation": "Invade",
          "detail": "You inject a memetic, proximity based virus into the target’s reactor. At the end of their next turn, if they are adjacent to another character or piece of terrain of Size 1 or larger, the virus catalyzes and they take 1d6+2 AP explosive damage. Once catalyzed, the effect ends.<br>A character can only be affected by one Purifying Code option at a time and are aware of their effects"
        }
      ],
      "description": "The key to the KOBOLD’s creation — a deceptively simple code that unlocks reactor safety limiters in civilian mining mechs. This also bears the only evidence pointing towards a possible creator: “Dog.”",
      "license_id": "mf_kobold"
    },
    {
      "id": "ms_immolate",
      "name": "IMMOLATE",
      "type": "System",
      "sp": 2,
      "source": "HORUS",
      "license": "Kobold",
      "license_level": 3,
      "actions": [
        {
          "name": "Eject Slag",
          "activation": "Invade",
          "detail": "You force the target’s reactor to eject burning liquid in a Burst 2 area around them, not affecting the space they occupy. The affected area becomes difficult terrain and characters that start their turn in it or that enter it for the first time in a round must succeed on an Engineering save or take 2 Heat and 1 Burn. The liquid cools, dissipating, at the end of your next turn."
        },
        {
          "name": "Molten Puncture",
          "activation": "Invade",
          "detail": "Until the end of the target’s next turn, their reactor shielding is temporarily cracked. They take 2 Burn for each space they voluntarily move (to a maximum of 6 Burn)."
        }
      ],
      "description": "The Kobold PG’s code is unique in that it can be injected into existing civilian mining mechs, allowing them to interact with the full suite of largely improvised, adapted weaponry and systems. The process skips printers entirely; however, in avoiding the constraints of Unionmonitored printers, the process also eschews widely accepted safety standards – a common theme among HORUS PGs. With no governors or consistent standards on the operational envelope of the K-PG, some pilots have discovered the terminal limits of their chassis the hard way.",
      "license_id": "mf_kobold"
    },
    {
      "id": "ms_tear_firmament",
      "name": "Wandering Nightmare",
      "type": "Tech",
      "sp": 1,
      "source": "HORUS",
      "license": "Lich",
      "license_level": 1,
      "actions": [
        {
          "activation": "Full Tech",
          "name": "Wandering Nightmare",
          "detail": "You generate a Blast 2 zone of distorted timeflow within SENSORS and line of sight that affects all characters other than you. Characters within the affected area cannot take reactions, and if they start their turn within it, they must succeed on a Systems save or take 2 Heat and become Slowed until the end of their next turn. This effect lasts until this action is taken again or the scene ends."
        }
      ],
      "description": "Speaker 1 (M.A2.SP1) [Audio, Length: 150:06][Dated 7658U, 35:50] (recovered: GZ Alhambra) [UIBTERMAGANT-TANGENT ROYAL]<br>“Where does it go? Where does it go? Where does it go? Where does it go? Where does it go? Where does it go? Where does it go? Where does it go? Where does it go? Where does it go?",
      "license_id": "mf_lich"
    },
    {
      "id": "ms_rewrite",
      "name": "Antilinear Time",
      "type": "Tech",
      "sp": 2,
      "source": "HORUS",
      "license": "Lich",
      "license_level": 2,
      "actions": [
        {
          "activation": "Quick Tech",
          "detail": "Choose a character in Sensors and line of sight. They clear all conditions other than Stunned that weren’t self-inflicted, and you immediately receive all conditions they cleared until the end of your next turn."
        }
      ],
      "description": "M.A2.SP1 [Audio loop, length 93:03][Dated 5008U, 16:50] (recovered: GZ Alhambra) [UIB-TERMAGANTTANGENT ROYAL]<br>“I have never been here: I do not know where here is: It has not happened yet: Once, I was: I have never been here: You are all I see: How can you be all I see: Where am I: Where did I go: I have never been here…”",
      "license_id": "mf_lich"
    },
    {
      "id": "ms_unhinge_chronoflow",
      "name": "Unhinge Chronology",
      "type": "Tech",
      "sp": 2,
      "source": "HORUS",
      "license": "Lich",
      "license_level": 2,
      "actions": [
        {
          "name": "Haste",
          "activation": "Quick Tech",
          "detail": "Choose a character within Sensors and line of sight. For the rest of this scene, or until they take damage, they may Boost 1/round as a free action during their turn."
        },
        {
          "name": "Slow",
          "activation": "Quick Tech",
          "detail": "Choose a character within Sensors and line of sight. They must pass a Systems save or take 2 Heat, become Slowed, and become unable to take reactions. This effects ends if they take any amount of damage or make a successful Systems save as a quick action."
        }
      ],
      "description": "M.A2.SP2 [Audio loop, diversion instance #1, timestamp 45:50] (recovered: GZ Alhambra) [UIBTERMAGANT-TANGENT ROYAL]<br>“Dark. Wet. Drink deep, and descend. The water is warm and well. It is very busy here, though you cannot see it. The swimmers are curious. The flea always jumps from time to time. It will drink it all. It will drink it deep—“",
      "license_id": "mf_lich"
    },
    {
      "id": "ms_stay_of_execution",
      "name": "Stay of Execution",
      "type": "Tech",
      "sp": 2,
      "tags": [
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_limited",
          "val": 2
        }
      ],
      "source": "HORUS",
      "license": "Lich",
      "license_level": 3,
      "actions": [
        {
          "activation": "Quick Tech",
          "detail": "Choose yourself or another character within Sensors and line of sight. Your target gains Immunity to all damage and effects from external sources until the end of their next turn, at which point they become STUNNED until the end of their following turn. Nothing can prevent or clear this condition.<br>During this time, any active effects on your target are frozen in time – effectively paused – and any relevant timers do not count down (e.g., conditions that would expire at the end of their turn now expire at the end of their following turn, reactor meltdown timers do not tick down, etc).<br>An unwilling character can ignore this effect with a successful Systems save."
        }
      ],
      "description": "Speaker 1 (M.A2.SP1) [Audio, Length: 150:06][Dated 5006U, 01:50] (recovered: GZ Alhambra) [UIBTERMAGANT-TANGENT ROYAL]<br>“I felt the bullet tear through me. I felt the bullet tear through me. I felt the pressure and it was my brother, his fist, my chest, and I was laying on my back and the sky was blue, and my mother hollered at him and the bullet had never hit me, and the legionnaire who shot me had not yet pulled the trigger, and so I killed him. I drank deep and killed him.”",
      "license_id": "mf_lich"
    },
    {
      "id": "ms_didymos_class_nhp",
      "name": "DIDYMOS-Class NHP",
      "type": "AI",
      "sp": 3,
      "tags": [
        {
          "id": "tg_ai"
        },
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_limited",
          "val": 3
        }
      ],
      "source": "HORUS",
      "license": "Lich",
      "license_level": 3,
      "actions": [
        {
          "name": "Time Split",
          "activation": "Quick Tech",
          "detail": "Choose yourself or another character within Sensors and line of sight. Your target disappears and you create a chronological split in their timeline, replacing them with two fields of mutating paradox energy appear as close to their original position as possible. These fields are new characters that look like holes in space of the same Size and roughly the same shape as your target (although you shouldn’t look at them too long). They have 10 HP, SPEED 5, Evasion 5, E-Defense 5, Heat Cap 5, and have Immunity to all conditions and statuses. They are controlled by the player of the affected character and both act on that character’s turn, starting with their next turn. The only actions the fields can take are standard moves and Boost, and the only reaction they can take is to disperse (see below). They are obstructions and grant hard cover.<br>If a field exceeds its HEAT CAP or is reduced to 0 HP, it immediately disappears. Their player can also cause a field to disappear as a reaction at the end of any character’s turn.<br>If one field disappears, the other immediately coalesces into the original character, who returns to the field in that field’s space. If both fields disappear at the same time, their player decides which field disappears first.<br>An unwilling character can ignore this effect with a successful Systems save"
        }
      ],
      "description": "PREPARED BY: UIB-TERMAGANT<br>RECOVERED FOR: CC_HOME OFFICE<br>CLEARANCE REQ: SOLEMN VIGIL (TANGENT ROYAL ADDENDUM)<br>Didymos. It means twin in an old, old tongue. It might be a bit too cute but it’s the name our cask spat out for us. We observed Didymos Prime in action during the fall of Green Zone Alhambra, mounted in a chassis we initially classified as a HORUS Minotaur PG, one of three we ID’d operating among the Ungrateful cell in New Madrassa.<br>It was not that Minotaur.<br>Alhambra fell in three days. The Armory wasn’t keen to give it up, but decided to cut their losses and pull back rather than hold for reinforcements. We moved in after, during the looting. Our local contact [][][][][][][][] escorted us to the New Madrassan commanders, introduced us to them, and secured an audience with the pilot of the chassis.<br>I’m sure you’ve reviewed the records of the debrief we recorded. We don’t know how it arrived in New Madrassa; the Ungratefuls say they received the initial code burst from their contact in the Voladores. The Voladores deny this; the entity, however, conforms to their descriptions of an entity called “la pulga,” or, “The Flea.” We have designated it LICH. Didymos is the active animus: what serves as its pilot.<br>We have taken the entity into custody. We do not recommend giving this one a long leash.",
      "license_id": "mf_lich"
    },
    {
      "id": "ms_accelerate",
      "name": "Accelerate",
      "type": "Tech",
      "sp": 2,
      "tags": [
        {
          "id": "tg_unique"
        }
      ],
      "source": "HA",
      "license": "Sunzi",
      "license_level": 1,
      "actions": [
        {
          "activation": "Quick Tech",
          "detail": "Choose and mark two free spaces within your line of sight that share a surface and are within Range 5 of each other. Characters that start their turn in one of these spaces or enter one for the first time in a round are pushed as far as possible in a straight line towards the other space. If they collide with an obstruction, they stop moving. They may avoid being pushed with a successful Hull save. Grenades, Deployables, or other loose objects of Size 1 or smaller that are thrown or deployed into one of the spaces are also pushed towards the other space before activating or detonating. They activate or detonate early if they are forced to stop by another character or object. This effect lasts for the rest of the scene, or until you take this Quick Tech option again."
        }
      ],
      "description": "Guillermo, no es suficiente saber caminar; Debes saber dónde y dónde no pisar. El lugar incorrecto, y te perderás. Es en un plano de telaraña donde construimos nuestro hogar: pise ligeramente cuando vaya.<br>[Guillermo, it is not enough to know how to walk; you must know where and where not to step; the incorrect spot, and you will be lost. It is on a plane of gossamer that we make our home: tread lightly when you go.]",
      "license_id": "mf_sunzi"
    },
    {
      "id": "ms_blink_charges",
      "name": "Blink Charges",
      "type": "Deployable",
      "sp": 3,
      "tags": [
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_limited",
          "val": 3
        },
        {
          "id": "tg_grenade"
        }
      ],
      "source": "HA",
      "license": "Sunzi",
      "license_level": 1,
      "deployables": [
        {
          "name": "Blink Mine",
          "type": "Mine",
          "detail": "Once detonated, the character that triggered it must pass an Engineering save or be teleported to a free, valid space of your choice within Range 5 of the mine and become JAMMED until the end of their next turn. If they pass, they still teleport but do not become Jammed."
        }
      ],
      "actions": [
        {
          "name": "Warp Grenade",
          "activation": "Quick",
          "detail": "Throw a grenade with Range 5 and Blast 3. On impact, choose any character within the affected area and teleport them to any free, valid space within the same area. An unwilling character can pass an Engineering save to avoid this effect"
        }
      ],
      "description": "Eso es lo que no se suena: usar el vacio contra la Ley de la Madre. Marcamos esta en nuestro historia con lagrimas, y ennegrecer la pagina.<br>[This is the thing un-thinkable: to use the nonshape against the Mother’s Law. With tears, we mark its need in our history, and then blacken the page]",
      "license_id": "mf_sunzi"
    },
    {
      "id": "ms_distort",
      "name": "Realspace Breach",
      "type": "Tech",
      "sp": 2,
      "tags": [
        {
          "id": "tg_unique"
        }
      ],
      "source": "HA",
      "license": "Sunzi",
      "license_level": 3,
      "actions": [
        {
          "activation": "Quick Tech",
          "detail": "You tear a hole in space, creating a Blast 1 area in a free space within Sensors and line of sight. Weapons with the Blast, Line, Burst, or Cone properties do not affect this area, and it may not be occupied by characters or objects for any reason. Any character or object that moves at least 1 space into the affected area immediately teleports to any free space adjacent to the area (of its player’s choice), or as close as possible. The affected area blocks line of sight; however, any character may target the hole in space with a ranged weapon (excluding Blast, Line, Burst, or Cone weapons) as if attacking it. Attackers don’t roll to hit the hole – instead, it absorbs the attack and redirects it against a new target of the attacker's choice within Range 10 of the zone. The attack resolves as if it originated within the hole. This effect lasts for the rest of the scene, or until you take this action again or end it as a quick action."
        }
      ],
      "description": "Dicen: \"Incluso es difícil de ver en este lugar\". Decimos: \"Usted tiene razón. Es porque este lugar no te quiere aquí.”<br>[They say: “It is even difficult to see in this place.” We say: “You are correct. It is because this place does not want you here.”]",
      "license_id": "mf_sunzi"
    },
    {
      "id": "ms_blinkspace_tunneler",
      "name": "Blinkspace Tunneler",
      "type": "System",
      "sp": 2,
      "tags": [
        {
          "id": "tg_heat_self",
          "val": 1
        }
      ],
      "source": "HA",
      "license": "Sunzi",
      "license_level": 2,
      "actions": [
        {
          "activation": "Protocol",
          "detail": "You open a blink tear in a free, adjacent space. It lasts until the end of your next turn. As part of any movement, characters other than you (hostile or allied) that enter the space at least partially may teleport to a free space adjacent to you. You may only open one tear at a time, and if you create a new tear it replaces the previous one."
        }
      ],
      "description": "MEMO(TT_CLEARANCE_01) (01200): IT’S GONNA GET REAL FUCKING DARK.",
      "license_id": "mf_sunzi"
    },
    {
      "id": "ms_unravel",
      "name": "Final Secret",
      "type": "Tech",
      "sp": 2,
      "tags": [],
      "source": "HA",
      "license": "Sunzi",
      "license_level": 3,
      "actions": [
        {
          "activation": "Quick Tech",
          "detail": "Choose yourself or another character within Sensors and line of sight. Your target is charged with unstable energy until the start of your next turn. Unwilling or hostile character can ignore this effect by succeeding on an Engineering save.<br>Each time your target takes damage for that duration, you may teleport them up to 4 spaces to a free, valid space of your choice as a reaction."
        }
      ],
      "description": "Dicen: \"Cuéntanos el secreto de tu larga vida, o abriremos la puerta de tu hogar a todo el mundo\".<br>Nosotros decimos: “Para vivir una larga vida, vives una larga vida. No tenemos secretos, todo lo que tenemos es el conocimiento que deseamos ocultarle. Por favor no hagas esto; tu no sabes nada.\"<br>[They say: “Tell us the secret to your long life, or we shall swing wide our door, and let those who we hold back inside your safe ground.”<br>We say: “To live a long life, you live a long life. We have no secrets, all we have is knowledge we wish to keep from you.”]",
      "license_id": "mf_sunzi"
    },
    {
      "id": "ms_total_strength_suite_i",
      "name": "Total Strength Suite I",
      "type": "System",
      "sp": 1,
      "source": "IPS-N",
      "license": "Zheng",
      "license_level": 1,
      "actions": [
        {
          "activation": "Quick",
          "detail": "You rip up a piece of the environment and hurl it at a character within Range 5 and line of sight. Your target must pass an Agility save or take 1d6 kinetic damage and be knocked back 1 space directly away from you. After you take this action, place a Size 1 piece of terrain that grants hard cover in a free space adjacent to your target, even if they passed the save. The terrain has 10 HP and Evasion 5.<br>If there is a Size 1 object or piece of cover adjacent to you, you can move it as part of this action; otherwise, your projectile is ripped out of the ground or environment. If there's nothing to grab nearby or you're not on the ground you can't take this action"
        }
      ],
      "description": "This whole-system upgrade was the result of tweaks Xiong Xiaoli made to her mech throughout a long career with the MSMC, many of which have now been incorporated into standard IPS-N frame construction protocol. The package comes in three stages, the first of which contains a set of spinal enhancements that allow a mech to rapidly lift and move large weights without systemic damage.",
      "license_id": "mf_zheng"
    },
    {
      "id": "ms_total_strength_suite_ii",
      "name": "Total Strength Suite II",
      "type": "System",
      "sp": 2,
      "tags": [
        {
          "id": "tg_unique"
        }
      ],
      "source": "IPS-N",
      "license": "Zheng",
      "license_level": 2,
      "actions": [
        {
          "activation": "Protocol",
          "detail": "Deal 1d6 kinetic damage to a character you are grappling."
        }
      ],
      "description": "The second part of Xiong’s enhancement package: interlocking muscle-analog plates beneath armor, finely tuned to greatly multiply crushing force.",
      "license_id": "mf_zheng"
    },
    {
      "id": "ms_total_strength_suite_iii",
      "name": "Total Strength Suite III",
      "type": "System",
      "sp": 3,
      "source": "IPS-N",
      "license": "Zheng",
      "license_level": 3,
      "actions": [
        {
          "activation": "Full",
          "detail": "You end a Grapple, pushing the other character 5 spaces in any direction and knocking them Prone. This movement may pass through spaces occupied by other characters but must end in a free space. All characters they pass through must pass a Hull save or be knocked Prone. If your target collides with an object or piece of terrain, they stop, take 1d6 kinetic damage, and must pass a Hull save or become STUNNED until the end of their next turn."
        }
      ],
      "description": "The last component of the Total Strength upgrade package gives a mech the ability to inject rapid bursts of intense power into its locomotive systems, resulting in short-lived but incredible strength. The underlying systems are carefully calibrated and misuse can rip apart a mech’s internal systems from within.",
      "license_id": "mf_zheng"
    },
    {
      "id": "ms_spaceborn_1",
      "name": "Spaceborn EVA",
      "type": "System",
      "talent_item": true,
      "talent_id": "t_spaceborn",
      "talent_rank": 1,
      "sp": 0,
      "tags": [
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_indestructible"
        }
      ],
      "source": "",
      "license": "",
      "license_level": 0,
      "effect": "All of your mechs that you build come with built-in EVA capabilities, meaning you suffer no penalties when operating underwater or in zero-g environments.",
      "actions": [
        {
          "activation": "Quick",
          "detail": "You can shunt power into this component to fly 3 spaces and take Heat equal to your mech’s Size + 1, although you must land at the end of this movement or fall."
        }
      ],
      "description": "Gained from the <i>Spaceborn: Rank I</i> pilot talent.",
      "license_id": ""
    }
  ],
  "talents.json": [
    {
      "id": "t_spaceborn",
      "name": "Spaceborn",
      "terse": "Improve your mobility and gain an inbuilt EVA suite",
      "description": "You’re adept at planting your feet wherever you find them – even on nothing at all. In places where people born downwell have a hard time keeping their lunch down, you thrive. Which way is up? It’s up to you",
      "ranks": [
        {
          "name": "Home in the Void",
          "description": "All of your mechs that you build come with built-in EVA capabilities, meaning you suffer no penalties when operating underwater or in zero-g environments. As a quick action, you can shunt power into this component to fly 3 spaces and take Heat equal to your mech’s Size + 1, although you must land at the end of this movement or fall.",
          "integrated": [
            "ms_spaceborn_1"
          ]
        },
        {
          "name": "Sea Legs",
          "description": "1/round, when your mech is involuntarily moved by another character’s attack or by failing a save forced by another character, you can choose the direction you move. Additionally, when your mech clears Prone, you may move 2 spaces in any direction as a free action. This movement ignores engagement and doesn’t provoke reactions"
        },
        {
          "name": "Scrapper",
          "description": "1/round, when your mech hits a character with a melee attack, it can immediately give that character +1 Difficulty on all checks or saves to avoid Knockback, Prone, Slowed or Immobilized until the end of its next turn, including any effects that are part of the triggering attack.",
          "synergies": [
            {
              "locations": [
                "weapon"
              ],
              "weapon_types": [
                "Melee"
              ],
              "weapon_sizes": [
                "any"
              ],
              "detail": "1/round, when your mech hits a character with a melee attack, it can immediately give that character +1 Difficulty on all checks or saves to avoid Knockback, Prone, Slowed or Immobilized until the end of its next turn, including any effects that are part of the triggering attack."
            }
          ]
        }
      ]
    },
    {
      "id": "t_black_thumb",
      "name": "Black Thumb",
      "terse": "Ride your mech to repair it during combat",
      "description": "You’re used to station engineering – the kind that regularly requires crawling through nightmarishly tight vents, squeezing past boiling-hot steam pipes, and tapping on thin panes of sheet metal that lie between you and certain death. After that, a little combat engineering is nothing.",
      "ranks": [
        {
          "name": "Flesh to Metal",
          "description": "You treat DISMOUNT as a quick action instead of a full action. When you DISMOUNT, your pilot gains a personal shield. The next time your pilot would take damage, reduce that damage to 0, then the shield disperses. Otherwise, it disperses at the end of the scene. You can only have one personal shield at once, and any shields created replace the last one.",
          "actions": [
            {
              "name": "Black Thumb Dismount",
              "activation": "Quick",
              "detail": "Dismount as per the normal Dismount action. When you DISMOUNT, your pilot gains a personal shield. The next time your pilot would take damage, reduce that damage to 0, then the shield disperses. Otherwise, it disperses at the end of the scene. You can only have one personal shield at once, and any shields created replace the last one.",
              "synergy_locations": [
                "dismount"
              ]
            }
          ]
        },
        {
          "name": "Rodeo",
          "description": "<p>As a protocol, you give up the controls, pop the hatch on your mech and partly climb out, starting a BLACK THUMB RODEO and gaining a personal shield (as above). While in rodeo, your pilot is immune to involuntary movement, occupies your mech’s space and moves when it moves. This does not count as DISMOUNT and the mech can’t be controlled from outside, so it will idle unless it is capable of acting independently (e.g., if it has an NHP that has been given control, which you can do as part of this protocol). <br>While in rodeo, your pilot becomes a valid target and can take damage normally. If you lose your personal shield for any reason, you are immediately forced back inside your mech, ending the effect, and you cannot start a rodeo again on your following turn. You can also end a rodeo as a quick action on any of your turns. <br>While in rodeo, your pilot can only take the <b>Extinguish</b>, <b>Field Repair</b>, or <b>Rig Vents</b> actions granted by Black Thumb.",
          "actions": [
            {
              "name": "Black Thumb Rodeo",
              "activation": "Protocol",
              "detail": "Gain a <b>personal shield</b> (as from Flesh to Metal). While in rodeo, your pilot is immune to involuntary movement, occupies your mech’s space and moves when it moves. This does not count as DISMOUNT and the mech can’t be controlled from outside, so it will idle unless it is capable of acting independently (e.g., if it has an NHP that has been given control, which you can do as part of this protocol).<br>While in rodeo, your pilot becomes a valid target and can take damage normally. If you lose your personal shield for any reason, you are immediately forced back inside your mech, ending the effect, and you cannot start a rodeo again on your following turn. You can also end a rodeo as a quick action on any of your turns.<br>While in rodeo, your pilot can only take the <b>Extinguish</b>, <b>Field Repair</b>, or <b>Rig Vents</b> actions granted by Black Thumb."
            },
            {
              "name": "End Black Thumb Rodeo",
              "activation": "Quick",
              "detail": "End your current Black Thumb Rodeo."
            },
            {
              "name": "BT: Extinguish",
              "activation": "Full",
              "detail": "You immediately clear all Burn affecting your mech, and it gains Resistance to Burn until the start of your next turn. Conditions that were self inflicted cannot be cleared with this action."
            },
            {
              "name": "BT: Field Repair",
              "activation": "Full",
              "detail": "Your mech gains Overshield 2 and clears either Slowed or Immobilized. Conditions that were self inflicted cannot be cleared with this action."
            },
            {
              "name": "BT: Rig Vents",
              "activation": "Full",
              "detail": "Your mech clears 2 Heat and clears either Impaired or Jammed. Conditions that were self inflicted cannot be cleared with this action."
            }
          ]
        },
        {
          "name": "Rodeo Master",
          "description": "Your Black Thumb actions can be used on adjacent allied mechs."
        }
      ]
    }
  ],
  "weapons.json": [
    {
      "id": "mw_kraul_rifle",
      "name": "Kraul Rifle",
      "mount": "Main",
      "type": "CQB",
      "damage": [
        {
          "type": "Kinetic",
          "val": "1d6"
        }
      ],
      "range": [
        {
          "type": "Range",
          "val": 8
        }
      ],
      "tags": [
        {
          "id": "tg_inaccurate"
        }
      ],
      "source": "SSC",
      "license": "Atlas",
      "license_level": 1,
      "on_hit": "your target is impaled by this weapon’s harpoon-like projectile. Any time after your target takes any action or movement during their next turn, you can reel in the line and boost as a reaction, moving toward that target by the most direct route possible. They must then pass a HULL save or be knocked PRONE; succeed or fail, this effect ends. The line snaps if your target teleports.",
      "description": "Hunting the Vast — the titanic megafauna of Sparr — is a dangerous, profitable venture for the Sparri people. Skins, bones, meat, and other trophies from their bodies can create months – or even years, in the case of especially old, grand, or unique beasts – of prosperity for the hunters and their kin. These popular long rifles, refined to SSC standards, are rugged and durable, perfect for dragging down the great creatures and their attendants.",
      "license_id": "mf_atlas"
    },
    {
      "id": "mw_terashima_blade",
      "name": "Terashima Blade",
      "mount": "Main",
      "type": "Melee",
      "tags": [
        {
          "id": "tg_unique"
        }
      ],
      "source": "SSC",
      "license": "Atlas",
      "license_level": 3,
      "effect": "You may begin any fight in any of this weapon's stances and may take a stance or shift between stances as a protocol. Once you have taken a stance, you remain in it until you take a new stance, this weapon is destroyed, or you are STUNNED or JAMMED. You can also drop a stance as a free action.",
      "actions": [
        {
          "name": "Change Stance",
          "activation": "Protocol",
          "detail": "Change this weapon's stance."
        },
        {
          "name": "Drop Stance",
          "activation": "Free",
          "detail": "Drop this weapon's stance."
        }
      ],
      "profiles": [
        {
          "name": "No Stance",
          "damage": [
            {
              "type": "Kinetic",
              "val": "1d6"
            }
          ],
          "range": [
            {
              "type": "Threat",
              "val": 1
            }
          ]
        },
        {
          "name": "Troll Stance",
          "damage": [
            {
              "type": "Kinetic",
              "val": "1d6+3"
            }
          ],
          "range": [
            {
              "type": "Threat",
              "val": 1
            }
          ],
          "tags": [
            {
              "id": "tg_inaccurate"
            },
            {
              "id": "tg_ap"
            }
          ]
        },
        {
          "name": "Storm Stance",
          "damage": [
            {
              "type": "Kinetic",
              "val": "1d6"
            }
          ],
          "range": [
            {
              "type": "Threat",
              "val": 1
            }
          ],
          "effect": "You gain the Storm Stance Reaction.",
          "actions": [
            {
              "activation": "Reaction",
              "name": "Storm Stance Reaction",
              "frequency": "1/round",
              "trigger": "After hitting with this weapon while in Storm Stance.",
              "detail": "You may immediately deal 2 kinetic to all other characters adjacent to you and your target."
            }
          ]
        },
        {
          "effect_type": "Profile",
          "name": "Lord's Stance",
          "damage": [
            {
              "type": "Kinetic",
              "val": "1d6"
            }
          ],
          "range": [
            {
              "type": "Threat",
              "val": 1
            }
          ],
          "effect": "You cannot make ranged or tech attacks, but any ranged attack against you that misses deflects off your sword, dealing 2 damage (same type as the attack) to a character of your choice in range 3 and line of sight from you. Any melee attack that misses you forces the attacker to pass a HULL save or be knocked PRONE."
        },
        {
          "effect_type": "Profile",
          "name": "Wind Stance",
          "damage": [
            {
              "type": "Kinetic",
              "val": "1d6"
            }
          ],
          "range": [
            {
              "type": "Threat",
              "val": 2
            }
          ],
          "effect": "After attacking with this weapon, hit or miss, you may move 2 spaces in any direction, ignoring engagement and reactions.",
          "tags": [
            {
              "id": "tg_reliable",
              "val": 2
            },
            {
              "id": "tg_knockback",
              "val": 2
            }
          ]
        }
      ],
      "description": "Forged in the fire of a corralled star in the Constellation, each of these blades bears a unique name and history defined by its users. Terashima blades are perfectly balanced and tempered, scalable from personal use up to Schedule 3. When combined with the weapon and sensor suites of a frame, they have been proven fast and durable enough to deflect weapons fire. Each blade crafted by the Terashima enclave is an heirloom produced once and delivered via conventional travel – their loss is considered an indescribable humiliation for the owner and an incredible triumph by the one who has taken it. The Terashima enclave keeps the casting mold of each blade it produces and displays them in their central hall alongside records of their known histories.",
      "sp": 2,
      "license_id": "mf_atlas"
    },
    {
      "id": "mw_hammer_u_rpl",
      "name": "Hammer U-RPL",
      "mount": "Heavy",
      "type": "Launcher",
      "damage": [
        {
          "type": "Explosive",
          "val": "2d6+3"
        }
      ],
      "range": [
        {
          "type": "Range",
          "val": 5
        }
      ],
      "tags": [
        {
          "id": "tg_inaccurate"
        },
        {
          "id": "tg_arcing"
        },
        {
          "id": "tg_knockback",
          "val": 2
        }
      ],
      "source": "IPS-N",
      "license": "Caliban",
      "license_level": 1,
      "effect": "",
      "description": "The Hammer Universal Rotary Projectile Launcher accepts any projectile or weapons system that fits the IPS-N Universal Cartridge System. Most common is the conventional airburst shell – a fragmentation system designed to operate in all theaters, oxygenated or not – a ferocious weapon in the compact halls, safe rooms, and bolt chambers of capital ships and stations.",
      "license_id": "mf_caliban"
    },
    {
      "id": "mw_hhs_155_cannibal",
      "name": "HHS-155 CANNIBAL",
      "mount": "Heavy",
      "type": "CQB",
      "tags": [
        {
          "id": "tg_loading"
        }
      ],
      "source": "IPS-N",
      "license": "Caliban",
      "license_level": 3,
      "effect": "You can fire this heavy shotgun twice before it needs to be reloaded. Alternatively, you may fire with both barrels at once, receiving +1 Difficulty, increasing its damage to 3d6+4 Kinetic and its KNOCKBACK to 4, but requiring it to be reloaded as usual. When this weapon is reloaded, you may choose to deal 5 Kinetic Damage to an adjacent character from the force of the ejecting shells.",
      "profiles": [
        {
          "name": "Single Barrel",
          "damage": [
            {
              "type": "Kinetic",
              "val": "2d6+4"
            }
          ],
          "range": [
            {
              "type": "Range",
              "val": 3
            },
            {
              "type": "Threat",
              "val": 3
            }
          ],
          "tags": [
            {
              "id": "tg_knockback",
              "val": 2
            },
            {
              "id": "tg_inaccurate"
            }
          ]
        },
        {
          "name": "Both Barrels",
          "damage": [
            {
              "type": "Kinetic",
              "val": "3d6+4"
            }
          ],
          "range": [
            {
              "type": "Range",
              "val": 3
            },
            {
              "type": "Threat",
              "val": 3
            }
          ],
          "tags": [
            {
              "id": "tg_knockback",
              "val": 4
            },
            {
              "id": "tg_inaccurate"
            }
          ],
          "effect": "Fire both barrels at once, causing the weapon to be fired with +1 Difficulty and requiring a reload as normal."
        }
      ],
      "description": "The IPS-N Heavy Howitzer-Shotgun 155 “Cannibal” is a large, breech-loaded, over-under cannon chambered to fire shells, shot, and sabots. This is the higher-powered version of the HHS-075, designed to phase out the “Daisy Cutter” by providing comparable stopping power in a format that can be more easily supplied to armies in the field. The Cannibal should be used with caution around mixed units of friendlies, as its ejection action clears the weapon’s barrels of spent cartridges with enough velocity to decapitate unarmored personnel.",
      "license_id": "mf_caliban"
    },
    {
      "id": "mw_fusion_rifle",
      "name": "Fusion Rifle",
      "mount": "Main",
      "type": "Rifle",
      "damage": [
        {
          "type": "Energy",
          "val": "1-6"
        }
      ],
      "range": [
        {
          "type": "Range",
          "val": 6
        }
      ],
      "tags": [],
      "source": "HORUS",
      "license": "Kobold",
      "license_level": 1,
      "effect": "This weapon deals damage equal to its RANGE from the target (up to a maximum of 6 Energy Damage).",
      "description": "Bootstrapped from powerful ore mining lasers, the Kobold’s simple fusion rifle is no less deadly for its humble origins. By burning through solid-state batteries to produce the necessary reaction, the rifle’s simple mechanism proved simple enough for untrained Ungratefuls to learn. As their tactics improved and Baronic forces were pushed back, the fusion rifle took on an iconic reputation and has become a symbol of resistance across the Baronies – often seen stenciled on walls and crossed on Ungrateful flags.",
      "license_id": "mf_kobold"
    },
    {
      "id": "mw_slag_cannon",
      "name": "Slag Cannon",
      "mount": "Main",
      "type": "Cannon",
      "damage": [
        {
          "type": "Energy",
          "val": "1d6"
        }
      ],
      "range": [
        {
          "type": "Range",
          "val": 8
        }
      ],
      "tags": [
        {
          "id": "tg_heat_self",
          "val": 1
        }
      ],
      "source": "HORUS",
      "license": "Kobold",
      "license_level": 2,
      "effect": "If your target is on the ground or a flat surface, once this attack resolves place a SIZE 1 mound of slag in a free space adjacent to them. The mound is an object with EVASION 5 and 10 HP.",
      "deployables": [
        {
          "name": "Slag",
          "type": "Deployable",
          "activation": "Free",
          "hp": "10",
          "evasion": "5",
          "detail": "Created by the Slag Cannon"
        }
      ],
      "description": "Dripping with molten fury, the Slag Cannon is quick to print and requires little training to use effectively. Temperamental but powerful, the Slag Cannon utilizes a simple rawmat-decomp system wedded to an insulated projector to break down, superheat, and cast a stream of plural-state particles at its target. Once cast in this way, the plural-state particles snap into coherence at a range of roughly 80-100 meters, creating base-element lumps of slag wherever they come to rest.",
      "license_id": "mf_kobold"
    },
    {
      "id": "mw_unraveler",
      "name": "Unraveler",
      "mount": "Main",
      "type": "Launcher",
      "damage": [
        {
          "type": "Energy",
          "val": "2d6"
        }
      ],
      "range": [
        {
          "type": "Range",
          "val": 10
        }
      ],
      "tags": [
        {
          "id": "tg_reliable",
          "val": 2
        }
      ],
      "source": "HORUS",
      "license": "Lich",
      "license_level": 1,
      "effect": "If an attack from this weapon would not deal enough damage to destroy its target or cause it to take at least 1 structure damage, it instead only deals RELIABLE 2 damage, even on a hit.",
      "description": "Speaker 2 (M.A2.SP2) [Audio, length: 120:36][34% corruption][Dated 18593U, 01:50] [UIB-TERMAGANTTANGENT ROYAL]<br>“Dark. Wet. Drink deep, and descend. The water is warm and well. It is very busy here, though you cannot see it. The swimmers are curious. Open your mouth.”",
      "license_id": "mf_lich"
    },
    {
      "id": "mw_warp_rifle",
      "name": "Warp Rifle",
      "mount": "Main",
      "type": "Rifle",
      "damage": [
        {
          "type": "Energy",
          "val": "1d3+1"
        }
      ],
      "range": [
        {
          "type": "Range",
          "val": 10
        }
      ],
      "tags": [
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_ap"
        },
        {
          "id": "tg_loading"
        }
      ],
      "source": "HA",
      "license": "Sunzi",
      "license_level": 2,
      "effect": "",
      "on_hit": "The target must pass an ENGINEERING save or be teleported a number of spaces equal to the damage you dealt with this weapon (including bonus damage, etc.; no more than 10 spaces), in a direction of your choice. They must end in a free, valid space.",
      "description": "Es una abominación. Dicen que \"es como los arados de las espadas; tú también debes aprender a defender tu hogar ”. Ptah, escupí su lógica de espada. Ni siquiera sabíamos de los arados compartidos antes de convertirlos en espadas, y éramos felices.<br>Hiciste la puerta, la abriste. No es nuestra responsabilidad cerrarla.<br>[It is an abomination. They say “it is like plowshares to swords; you too must learn to defend your home.” Ptah, I spit on their blade-law. We did not even know of plowshares before they beat them into swords, and we were happy.<br>You made the door, you swung it open — it is not our responsibility to close it.]",
      "sp": 1
    },
    {
      "id": "mw_xiaoli_combat_sheathe",
      "name": "Tiger-Hunter Combat Sheathe",
      "mount": "Main",
      "type": "Melee",
      "damage": [
        {
          "type": "Kinetic",
          "val": "1d3+2"
        }
      ],
      "range": [
        {
          "type": "Threat",
          "val": 1
        }
      ],
      "tags": [],
      "source": "IPS-N",
      "license": "Zheng",
      "license_level": 1,
      "effect": "This weapon can attack two targets at a time, and can be used even while JAMMED.",
      "description": "This enhancement encases a mech’s manipulators and brachial structures in a powerful reactive alloy weave, allowing it to use its fists as blunt weapons, even unarmed.",
      "license_id": "mf_zheng"
    },
    {
      "id": "mw_d_d_288",
      "name": "D/D 288",
      "mount": "Superheavy",
      "type": "Melee",
      "source": "IPS-N",
      "license": "Zheng",
      "license_level": 3,
      "effect": "Unlike other Superheavy weapons, this weapon can be used with the basic profile to Skirmish.<br>You may charge this weapon as a quick action. While charged, you benefit from soft cover, but you are SLOWED, take 2 Heat at the start of your turn, and can no longer use the D/D 288 with SKIRMISH. At the start of any of your turns while it is charged, it has the Charged profile.",
      "actions": [
        {
          "name": "Charge D/D 288",
          "activation": "Quick",
          "detail": "Charge the D/D 288. At the start of any of your turns while the D/D 288 is Charged, it uses the \"Charged\" profile. You become SLOWED, and benefit from soft cover. Additionally, gain 2 Heat at the start of your turn.<br>The \"Charged\" profile cannot be used to Skirmish."
        }
      ],
      "profiles": [
        {
          "name": "Uncharged",
          "damage": [
            {
              "type": "Kinetic",
              "val": "1d6"
            }
          ],
          "range": [
            {
              "type": "Threat",
              "val": 1
            }
          ],
          "tags": [
            {
              "id": "tg_reliable",
              "val": 3
            }
          ],
          "skirmish": true
        },
        {
          "name": "Charged",
          "damage": [
            {
              "type": "Explosive",
              "val": "4d6+8"
            }
          ],
          "range": [
            {
              "type": "Threat",
              "val": 3
            }
          ],
          "skirmish": false,
          "on_hit": "While charged, this weapon deals 30 AP Kinetic Damage when it hits objects or pieces of terrain. If this destroys objects and pieces of terrain, they explode, dealing 1d6 Kinetic Damage to all adjacent characters other than you and knocking them back 1 space.<br>This weapon loses its charge when you hit a target, when you disperse its charge as a free action, or when you become STUNNED or SHUT DOWN.",
          "tags": [
            {
              "id": "tg_reliable",
              "val": 8
            },
            {
              "id": "tg_knockback",
              "val": 8
            }
          ]
        }
      ],
      "description": "The Zheng’s Devastator/Demolition Weapon 288 is legendary for its ability to breach armor and inflict total destruction on hardened targets. Originally rigged up as a last resort by Xiong Xiaoli, this fistmounted system repurposes a mech reactor’s primary heat vent into a directional, engagement-proximity weapon. The production line D/D 288 must be primed before firing, requiring a dangerous power draw from the mechs’ systems; Trunk Security’s reportage of the recovery mission assumes that using this weapons is what killed Xiong Xiaoli and cored the White Tiger’s gunboat. The D/D 288’s ability to cause enormous collateral damage and its spectacular discharge when fired have earned it the moniker ‘Shā mǎ zhǎng’ or Horse-Killing Palm among MSMC pilots.",
      "license_id": "mf_zheng"
    },
    {
      "id": "mw_caliban_integrated",
      "name": "HHS-075 “Flayer” Shotgun",
      "mount": "Main",
      "type": "CQB",
      "profiles": [
        {
          "name": "Standard",
          "range": [
            {
              "type": "Range",
              "val": 3
            },
            {
              "type": "Threat",
              "val": 3
            }
          ],
          "damage": [
            {
              "type": "Kinetic",
              "val": "1d6+1"
            }
          ],
          "tags": [
            {
              "id": "tg_inaccurate"
            },
            {
              "id": "tg_knockback",
              "val": 2
            }
          ],
          "on_attack": "After any attack with this weapon, you may smack an adjacent character with the butt end, dealing 1 Kinetic Damage and knocking them back 1 space."
        },
        {
          "name": "Autochoke Equipped",
          "range": [
            {
              "type": "Cone",
              "val": 3
            },
            {
              "type": "Threat",
              "val": 3
            }
          ],
          "damage": [
            {
              "type": "Kinetic",
              "val": "1d6+2"
            }
          ],
          "tags": [
            {
              "id": "tg_accurate"
            },
            {
              "id": "tg_knockback",
              "val": 5
            }
          ],
          "on_attack": "After any attack with this weapon, you may smack an adjacent character with the butt end, dealing 1 Kinetic Damage and knocking them back 1 space."
        }
      ],
      "license_id": ""
    }
  ]
}
