{
  "environments.json": [
    {
      "id": "env_improvisedexplosives",
      "name": "Improvised Explosives",
      "description": "A number of improvised explosives are marked on the map. Each one is a Size 1/2 object with Evasion 5 and E-Defense 5 that explodes with a Burst 1 area upon taking any damage or heat. All characters within the affected area must succeed on an Agility save or take 2d6 explosive damage. On a success, they take half damage."
    },
    {
      "id": "env_fueltanks",
      "name": "Fuel Tanks",
      "description": "A number of fuel tanks are marked on the map. Each one is a Size 1 object with Evasion 5 and E-Defense 5 that explodes with a Burst 1 area upon taking any damage or heat. All characters within the affected area must succeed on an Agility save or take 2d6 explosive damage. On a success, they take half damage. The affected area then becomes a patch of burning fuel that counts as dangerous terrain that inflicts 5 Burn. Objects and terrain within the affected area are completely destroyed."
    }
  ],
  "frames.json": [
    {
      "id": "mf_chomolungma",
      "source": "GMS",
      "license_level": 0,
      "name": "Chomolungma",
      "mechtype": [
        "Controller",
        "Support"
      ],
      "description": "<p>While the public perception of GMS may be that of a stolid, conservative manufacturer, Union devotes substantial resources to the research and development of new armaments and technological breakthroughs in order to maintain or exceed parity with galactic-tier actors such as Harrison Armory or the Karrakin Trade Baronies. Under development by Union&apos;s Advanced Projects Special Research Agency in conjunction with General Massive Systems, the Chomolungma is a newer and more technologically advanced frame using the standard GMS Pattern I design as a base.</p><p>The Chomolungma is a specialist chassis, trading out weapon hardpoint mounting capability for additional sensors, comms/transmission arrays, and advanced GMS e-war systems including cutting-edge systemic intrusion software packages and recursive-weave hyperprocessors. In light of recent conflicts, Union has begun increasing distribution of Chomolungma licenses among both regular and auxiliary units to keep pace with evolutionary developments in battlefield tactics and technologies.</p>",
      "mounts": [
        "Main/Aux",
        "Flex"
      ],
      "stats": {
        "size": 1,
        "structure": 4,
        "stress": 4,
        "armor": 0,
        "hp": 10,
        "evasion": 8,
        "edef": 10,
        "heatcap": 6,
        "repcap": 4,
        "sensor_range": 15,
        "tech_attack": 1,
        "save": 11,
        "speed": 4,
        "sp": 7
      },
      "traits": [
        {
          "name": "Brilliance",
          "description": "1/scene, the Chomolungma may take any Quick Tech action as a free action, and then may either Bolster or Lock On as a free action."
        },
        {
          "name": "Data Siphon",
          "description": "Whenever the Chomolungma makes a tech attack against a hostile character, it may also automatically Scan them."
        },
        {
          "name": "Replaceable Parts",
          "description": "While resting, the Chomolungma can be repaired at a rate of 1 Repair per 1 structure damage, instead of 2 Repairs."
        }
      ],
      "core_system": {
        "name": "Advanced Intrusion Package",
        "active_name": "Wide-Area Code Pulse",
        "active_effect": "Choose any number of hostile characters within Sensors and make a special Invade tech attack against them, ignoring Invisible and line of sight. On hit, apply the effects of Invade as normal, choosing options for each target. On miss, targets become Impaired until the end of their next turn.",
        "activation": "Full",
        "passive_name": "Advanced Intrusion Package",
        "passive_effect": "Gain the following options for Invade:",
        "passive_actions": [
          {
            "name": "Balance Control Lockout",
            "activation": "Invade",
            "detail": "Push your target 2 spaces in any direction and knock them Prone. If they are already Prone, they become Immobilized until the end of their next turn. You may only Immobilize each character this way 1/scene.",
            "cost": 0,
            "tech_attack": true
          },
          {
            "name": "System Crusher",
            "activation": "Invade",
            "detail": "Your target takes an additional 2 heat, for a total of 4 heat. If this Invade causes them to exceed their Heat Cap, they take 4 burn as well. This can only be used 1/scene on each character.",
            "cost": 0,
            "tech_attack": true
          }
        ]
      },
      "image_url": "https://d2c79xe1p61csc.cloudfront.net/frames/nodata.png",
      "y_pos": 0
    }
  ],
  "lcp_manifest.json": {
    "name": "Operation Solstice Rain Data",
    "author": "Massif Press",
    "description": "Player-side data for Operation Solstice Rain, a structured mission module for Lancer, written and designed by Kai Tave. Includes the GMS Chomolungma, new talents, and exotic gear.",
    "item_prefix": "osr",
    "version": "1.2.0",
    "image_url": "https://img.itch.zone/aW1nLzExMTQ3Mzc4LnBuZw==/315x250%23cb/gKzgBK.png",
    "website": "https://massif-press.itch.io/operation-solstice-rain"
  },
  "reserves.json": [
    {
      "id": "reserve_up_armoring",
      "name": "Up-Armoring",
      "type": "Mech",
      "label": "Resource",
      "description": "It’s a simple and straightforward battlefield modification to affix additional plating to a chassis’ exterior. Your mech gains +1 Armor for the duration of the next mission (to a maximum of 4), and you start the next combat with +5 Overshield.",
      "bonuses": [
        {
          "id": "armor",
          "val": 1
        }
      ]
    },
    {
      "id": "reserve_hot_load_ammunition",
      "name": "Hot-Load Ammunition",
      "type": "Tactical",
      "label": "Resource",
      "description": "Adding this much additional power to a weapon’s ammunition is generally not sanctioned, but it is effective. You can spend this reserve to empower your weapons. The next successful ranged or melee attack you make can’t have its damage reduced in any way, and the target must pass a Hull save or be knocked Prone. This effect ends when you hit with a ranged or melee attack roll, or at the end of the scene."
    },
    {
      "id": "reserve_recon_drone",
      "name": "Recon Drone",
      "type": "Tactical",
      "label": "Resource",
      "description": "With the intense signal jamming blanketing the city, these high-ceiling, long-loiter drones provide some of the best intel a pilot is likely to get. At the start of each combat, choose a single hostile character within Range 50 and Scan them. This does not require line of sight."
    },
    {
      "id": "reserve_sniper_team",
      "name": "Sniper Team",
      "type": "Tactical",
      "label": "Resource",
      "description": "LSA ground forces and Union marines are getting a crash-course in joint operations on this mission, and nothing builds teamwork like target shooting. You can spend this reserve at the start of any combat to call upon a nearby sniper team to provide you with fire support. For the rest of the scene, each time you take the Lock On Quick Tech action, your target takes 2 AP kinetic damage."
    },
    {
      "id": "reserve_lookingglass",
      "name": "LOOKINGGLASS Overlay",
      "type": "Mech",
      "label": "Resource",
      "description": "This head-mounted sensor add-on is capable of defeating even advanced thermal/optic/systemic camouflage systems, though it can only operate at that level of intensity for a short duration before burning out. You can spend this reserve during any combat to activate the sensors. For the rest of the scene you ignore soft cover and ignore Invisible for characters within Range 3. Hostile characters within Range 3 can’t become Hidden, though they remain Hidden if they were already."
    },
    {
      "id": "reserve_leg_enhancements",
      "name": "Leg Enhancements",
      "type": "Mech",
      "label": "Resource",
      "description": "Mechs are already built to navigate uneven terrain, but joint and servo reinforcements can make a good thing even better. Your mech ignores difficult terrain for the duration of the upcoming mission. Additionally, once during the mission you can spend this reserve to ignore Slowed or Immobilized received from a hostile source, negating the condition as it happens."
    },
    {
      "id": "reserve_high_mobility_pack",
      "name": "High-Mobility Pack",
      "type": "Mech",
      "label": "Resource",
      "description": "The LSA uses these externally mounted flight units for rapid assault and air-drop operations, and the schematics are easy enough to modify and print to GMS standard. You can spend this reserve at the start of any combat to count any and all of your movement as flying for the rest of that scene. Additionally, you may deploy yourself anywhere on the map after all other characters (PCs and NPCs) have deployed."
    },
    {
      "id": "reserve_golden_ticket",
      "name": "Golden Ticket",
      "type": "Resource",
      "label": "Resource",
      "description": "1st Lt. Kim is only authorized to distribute so many limited-access licenses, but a little off-the-books code-cloning by Rio can help stretch those licenses a bit further. You gain a piece of Exotic Gear from Operation Solstice Rain."
    },
    {
      "id": "reserve_personal_touch",
      "name": "Personal Touch",
      "type": "Mech",
      "label": "Resource",
      "description": "It looks like Vonna’s taken a shine to you, or at the very least taken a shine to your chassis. Your mech gains a free Custom Paint Job for the duration of the next mission, and you can also spend this reserve to gain +1 Accuracy on all mech skill checks and saves during a combat of your choice."
    },
    {
      "id": "reserve_return_to_sender",
      "name": "Return to Sender",
      "type": "Mech",
      "label": "Resource",
      "description": "Using a captured artillery shell as a chassis-deployed improvised explosive device is incredibly unwise, but it’s probably not the worst decision a pilot’s ever made. Your mech is equipped with a powerful, single-use explosive. 1/mission, you can create a Blast 2 explosion within Range 3 as a quick action. Affected characters must pass an Agility save or take 3d6 explosive damage, or half damage on a success. Objects, cover, and terrain within the area automatically take 30 AP explosive damage. Only one PC can have this reserve at a time; anyone rolling this result again picks another reserve of their choice from this list."
    }
  ],
  "systems.json": [
    {
      "id": "ms_adjutant_class_compcon",
      "name": "ADJUTANT-Class Comp/Con",
      "source": "EXOTIC",
      "license": "",
      "license_level": 0,
      "effect": "<p>Your mech gains the AI tag and Active Assist.</p><p>Additionally, you may load one talent rank you qualify for but do not have onto this system’s ontologic bridge. You gain access to that talent while piloting your mech. If this system is destroyed, neither this talent nor any systems or mech capabilities it grants can be used until it’s repaired. You may choose a different talent rank whenever you take a Full Repair.</p><p>This system isn’t a full NHP and cannot enter cascade.</p>",
      "type": "AI",
      "sp": 3,
      "description": "<p>A major cornerstone of GMS's advanced technology initiative is the planned development of a next-generation companion/concierge system to replace the standard EPIPHANY-Class C/C currently in use by Union pilots. For reasons both practical as well as ethical, widespread dissemination of chassis-compatible C/C systems is currently being pushed by Union CentComm over military NHP design, and the ADJUTANT is the latest model to be approved for limited field trials following First Contact Accords compliance evaluation. Utilizing a new-model ontologic bridge framework, ADJUTANT allows for the use of selected simulant/reflex architectures to be uploaded to an engrammatic matrix for compatible pilot integration along both first- and second-tier neural processes. Long-term effects of repeated engrammatic synthesis are currently unknown, but early feedback is promising with test pilots reporting minimal difficulty expressing previously unheld aptitudes.</p>",
      "tags": [
        {
          "id": "tg_ai"
        },
        {
          "id": "tg_no_cascade"
        },
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_exotic"
        }
      ],
      "actions": [
        {
          "name": "Active Assist",
          "activation": "Free",
          "detail": "1/scene, you may take a quick action of your choice. This action cannot be an attack or force any saves.",
          "cost": 0
        }
      ]
    },
    {
      "id": "ms_pattern_c_advanced_charges",
      "name": "Pattern-C Advanced Charges",
      "source": "EXOTIC",
      "license": "",
      "license_level": 0,
      "effect": "Expend a charge from this system for one of the following effects:",
      "type": "System",
      "sp": 3,
      "description": "<p>GMS’s latest intelligent munition system is a self-contained, multi-mode weapon designed to be easily deployable from a variety of chassis. Boasting advanced decision-making capabilities, each drone-tier charge is capable of independent target selection and interception, maintaining regular pilot-in-the-loop protocols to ensure optimal detonation parameters.</p>",
      "tags": [
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_limited",
          "val": 3
        },
        {
          "id": "tg_exotic"
        }
      ],
      "actions": [
        {
          "name": "Smart Grenade",
          "activation": "Quick",
          "detail": "All hostile characters within the affected area must pass a Systems save or take 1d6 energy damage and gain Lock On. On a success, they gain Lock On only.",
          "pilot": false,
          "damage": [
            {
              "type": "Energy",
              "val": "1d6"
            }
          ],
          "range": [
            {
              "type": "Range",
              "val": "5"
            },
            {
              "type": "Blast",
              "val": "1"
            }
          ]
        }
      ],
      "deployables": [
        {
          "name": "Lurker Mine",
          "type": "Mine",
          "detail": "This mine does not detonate as normal. Instead, gain the Selective Detonation reaction, which can be performed once per deployed lurker mine.",
          "damage": [
            {
              "type": "Explosive",
              "val": "2d6"
            }
          ],
          "range": [
            {
              "type": "Burst",
              "val": 1
            }
          ],
          "actions": [
            {
              "name": "Selective Detonation",
              "activation": "Reaction",
              "detail": "The mine detonates and affected characters must pass an Agility save or take 2d6 explosive damage. On a success, they take half damage.",
              "trigger": "A character enters the lurker mine’s space or an adjacent space, or begins their turn there.",
              "damage": [
                {
                  "type": "Explosive",
                  "val": "2d6"
                }
              ],
              "range": [
                {
                  "type": "Burst",
                  "val": 1
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ms_miniaturized_linac_coherent_beam_cannon",
      "name": "Miniaturized LinAc Coherent Beam Cannon",
      "source": "EXOTIC",
      "license": "",
      "license_level": 0,
      "effect": "Your mech gains an additional Core System that can be used 1/mission.",
      "type": "System",
      "sp": 1,
      "description": "<p>Cressidium’s self-imposed isolation has led to a number of divergent technological advances over the centuries, among them the pursuit of more compact lance weapon development as opposed to further exploration and refinement of naval long-cycle weaponry. Weapons engineers looked to miniaturization, incorporating chemical and exotic-metal batteries and rapid-charge fire-cycling systems suitable for use on smaller and smaller platforms, ultimately including mechanized chassis. This example, reverse-engineered from combat data gathered by Union pilots during an engagement against Vestan Sovereignty special forces, appears to be a descendant of old linear accelerator coherent beam cannon designs – weapons now considered out of date by contemporary naval standards but which are nonetheless exceedingly lethal when employed at this scale.</p>",
      "tags": [
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_exotic"
        }
      ],
      "actions": [
        {
          "name": "LinAc CBC",
          "activation": "Full",
          "detail": "Activate this devastating charged particle cannon, firing it in a Line 30 path. All sources of cover, terrain, objects, and deployables smaller than Size 5 in this area are boiled away instantly, and then all characters within the area must pass an Agility save or take 14 energy damage. On a success, they take half damage. This damage can’t be reduced in any way. Characters with 7 HP or less, only 1 Structure remaining, and no Immunity to damage are instead instantly and automatically destroyed, annihilated utterly and leaving no wreck behind.<br>You can take no other actions on the same turn you activate this particle cannon except for your standard move or Boost, and the stress of firing it causes you to become Stunned until the start of your next turn.",
          "damage": [
            {
              "type": "Energy",
              "val": 14
            }
          ],
          "range": [
            {
              "type": "Line",
              "val": 30
            }
          ]
        }
      ]
    }
  ],
  "talents.json": [
    {
      "id": "t_demolitionist",
      "name": "Demolitionist",
      "terse": "Improve your grenades and mines to fly further and hit harder",
      "description": "Explosives and warfare go together like alcohol and bad decisions. The power of a bomb in the palm of your hand is a great equalizer, and a well-placed satchel charge or two has brought even the mightiest of fortifications tumbling down. Forget bullets with names etched on them, the packages you deliver go out addressed “To Whom It May Concern,” and you’ve got plenty to go around.",
      "ranks": [
        {
          "name": "Frag and Clear",
          "description": "When you use a Grenade, you may choose one character in the affected area to ignore its effects. Additionally, at the end of each scene, you restore 1 charge to each Limited system with the Mine tag for each undetonated Mine you deployed from that system."
        },
        {
          "name": "Quarterback",
          "description": "Your Grenades gain +3 Range, and you can plant Mines up to Range 3 (or add +3 Range to them if they have one). Additionally, you do not require line of sight for Grenades and Mines as long as it’s possible to trace a path to the target."
        },
        {
          "name": "Fire in the Hole",
          "description": "<p>Your explosive charges have been enhanced with customized payloads. 1/round, you may choose one of the following:</p> <ul> <li>When you throw a Grenade, up to three characters within Range 3 of the targeted space take 2 explosive damage and are knocked back 1 space in a direction of your choice by explosive shrapnel.</li> <li>When a character fails a save against one of your Mines, they take +1d6 explosive bonus damage. If the mine deals no damage normally when detonated, whether it forces a save or not, one character in the affected area takes 1d6 explosive damage instead.</li> </ul>"
        }
      ]
    },
    {
      "id": "t_sysop",
      "name": "Sysop",
      "terse": "Improve your Bolster to shield your allies from systemic attacks",
      "description": "Modern systemic warfare is a filthy mess of code-worms, logic bombs, and adaptive viruses, to say nothing of all the physical detritus that litters the battlefield, and you’re the one responsible for keeping things clean. System operator or system optimizer, formatting software barriers or tuning servos, your command of diagnostic programs and deep-level hardware overrides gives you all the tools you need to push your squad’s limits beyond manufacturer spec with orderly, surgical precision.",
      "ranks": [
        {
          "name": "Inoculation",
          "description": "When you Bolster an allied character, the additional Accuracy they gain lasts until their next skill check or save.",
          "synergies": [
            {
              "locations": [
                "bolster"
              ],
              "detail": "When you Bolster an allied character, the additional Accuracy they gain lasts until their next skill check or save."
            }
          ]
        },
        {
          "name": "Firewall",
          "description": "When you Bolster an allied character, tech attacks against them receive +1 Difficulty until the end of their next turn.",
          "synergies": [
            {
              "locations": [
                "bolster"
              ],
              "detail": "When you Bolster an allied character, tech attacks against them receive +1 Difficulty until the end of their next turn."
            }
          ]
        },
        {
          "name": "Aggressive Countermeasures",
          "description": "1/round, when you Bolster an ally, you induce a special cycle into their reactor. They reduce the next amount of heat they would take from a hostile character to 0, and that character takes 2 heat and becomes Impaired until the end of their next turn. This effect does not stack, and lasts until triggered.",
          "synergies": [
            {
              "locations": [
                "bolster"
              ],
              "detail": " 1/round, when you Bolster an allied character, you induce a special cycle in their reactor. They reduce the next amount of heat they would take from a hostile character to 0, and that character takes 2 heat and becomes Impaired until the end of their next turn. This effect does not stack, and lasts until triggered."
            }
          ]
        }
      ]
    }
  ],
  "weapons.json": [
    {
      "id": "mw_xc_br_battle_rifle",
      "name": "XC-BR Battle Rifle",
      "source": "EXOTIC",
      "license": "",
      "license_level": 0,
      "description": "The GMS MC-AR assault rifle currently in use throughout Union’s forces and beyond is a time-tested and reliable design. Rather than attempting to replace it outright, CentComm's Defense Logistics Committee has put out a call for a supplementary standardized battle rifle system that can operate alongside the MC-AR in mixed fireteams, or as a primary weapon system for engaging heavily armored opposition at longer ranges than the MC-TR thermal rifle. The XC-BR uses an advanced caseless electrochemical propellant design capable of firing larger-caliber, armor-defeating rounds while minimizing recoil along with an integrated dynamic targeting system, though the weapon is still plagued by intermittent heat issues that can adversely affect performance.</p>",
      "effect": "You may attack characters with the Lock On condition using this weapon as though it is Range 15.",
      "on_attack": "",
      "on_hit": "",
      "on_crit": "Your target gains Lock On.",
      "mount": "Main",
      "type": "Rifle",
      "cost": 1,
      "barrage": true,
      "skirmish": true,
      "damage": [
        {
          "type": "Kinetic",
          "val": "1d6"
        }
      ],
      "range": [
        {
          "type": "Range",
          "val": 10
        }
      ],
      "sp": 0,
      "tags": [
        {
          "id": "tg_ap"
        },
        {
          "id": "tg_overkill"
        },
        {
          "id": "tg_exotic"
        }
      ]
    },
    {
      "id": "mw_xc_dpm_predator_nexus",
      "name": "XC-DPM Predator Nexus",
      "source": "EXOTIC",
      "license": "",
      "license_level": 0,
      "description": "<p>One of GMS’s most advanced nexus weapons currently undergoing field-testing, the XC-DPM Predator project is the direct descendant of the earlier MC-DHK Hunter-Killer program, itself a joint venture between the Advanced Projects Special Research Agency and GMS engineers. The Predator nexus benefits from a comprehensive targeting and autonomy upgrade, incorporating MD+ “Muse Drive” smart weapon design. This system’s heuristics, though declared Turing-Null, display startlingly advanced target acquisition capabilities even when confronted with active countermeasures that might otherwise confound traditional smart weapon platforms.</p>",
      "effect": "Attacks with this weapon ignore Invisible.",
      "on_attack": "",
      "on_hit": "",
      "on_crit": "",
      "mount": "Main",
      "type": "Nexus",
      "cost": 1,
      "barrage": true,
      "skirmish": true,
      "damage": [
        {
          "type": "Kinetic",
          "val": "1d6"
        }
      ],
      "range": [
        {
          "type": "Range",
          "val": 10
        }
      ],
      "sp": 0,
      "tags": [
        {
          "id": "tg_accurate"
        },
        {
          "id": "tg_smart"
        },
        {
          "id": "tg_exotic"
        }
      ]
    }
  ]
}
