{
  "core_bonuses.json": [
    {
      "id": "cb_order_of_leander",
      "name": "Order of Leander",
      "source": "GMS",
      "effect": "1/scene, you may add +1 Accuracy to any attack, check, or save made by you or an allied character within Range 10, adding an additional +1 Accuracy for each structure damage you have; allied characters who receive this bonus also gain Grit+4 Overshield. If you take structure damage during the scene after this ability is expended, you may use it a second time.<br><br>This core bonus counts as a piece of Exotic Gear.",
      "description": "The Order of Leander is a Leandric States Alliance commendation given to those who have shown \"exemplary character, courage, and determination under great adversity.\" While primarily a military citation, precedent exists for it to be awarded to civilians as well, with a number of noteworthy historical figures having earned it for efforts during natural disasters, search-and-rescue missions, and medical crises. In Cressidium's settled history, no one from any other world has ever earned this award, but whether you come from beyond the stars or not, for your service in defense of both the LSA as well as Cressidium you have earned the right to wear it with pride."
    }
  ],
  "frames.json": [
    {
      "id": "mf_gilgamesh",
      "license_level": 2,
      "source": "HA",
      "name": "Gilgamesh",
      "mechtype": [
        "Striker"
      ],
      "description": "The Gilgamesh is Harrison Armory's multirole Legionnaire model chassis, designed to be distributed to Armory legions and Acquisition & Management Teams across the Purview and beyond. Built to be fully compatible with numerous hardpoint-mounted tactical system enhancements and munitions, the Gilgamesh excels at no one task in particular, but its comprehensive modular construction and rugged engineering allow it to perform a variety of combat duties without difficulty within numerous theaters. Beyond the logistical efficiency of a standardized, easy to handle chassis meant to streamline both materiel concerns and aptitude training across multiple worlds and cultures, the Gilgamesh has another purpose as well; further reducing the Armory's remaining dependence on foreign-manufactured chassis designs, in particular the GMS Everest.<br><br>Some commissioned officers have a tendency to look down upon Gilgamesh pilots for using what they view as an unglamorous \"trainer\" chassis, but other commanders are fierce proponents of the design, even choosing to pilot it themselves in order to lead by example, and in certain regions of the Purview the Gilgamesh is regarded with as much admiration as more sophisticated models such as the Sherman.",
      "mounts": [
        "Main",
        "Flex",
        "Heavy"
      ],
      "stats": {
        "size": 1,
        "structure": 4,
        "stress": 4,
        "armor": 1,
        "hp": 8,
        "evasion": 8,
        "edef": 8,
        "heatcap": 7,
        "repcap": 4,
        "sensor_range": 10,
        "tech_attack": 0,
        "save": 11,
        "speed": 4,
        "sp": 6
      },
      "traits": [
        {
          "name": "Load-Bearing Hardpoints",
          "description": "All Limited systems and weapons equipped to the Gilgamesh gain +1 charge.",
          "bonuses": [
            {
              "id": "limited_bonus",
              "val": 1
            }
          ]
        },
        {
          "name": "Locked and Loaded",
          "description": "The Gilgamesh has a Loadout Die, 1d6 starting at 6. Each time it expends a Limited charge, reduce the value of the Loadout Die by 1. When the Loadout Die reaches 1, you may reset it to 6 to reroll one attack, check, or save, though the second result must be kept. The value of the Loadout Die persists between scenes but resets to 6 when you perform a Full Repair.",
          "counters": [
            {
              "id": "gilgamesh_arsenal",
              "name": "Arsenal Die",
              "default_value": 6,
              "min": 1,
              "max": 6
            }
          ]
        }
      ],
      "core_system": {
        "name": "Exoframe Engineering",
        "description": "The Gilgamesh was designed from the ground up to be easy and inexpensive to both construct and maintain, but to Harrison Armory \"inexpensive\" does not equal shoddy or inefficient. Instead, the Gilgamesh utilizes a unique two-stage chassis design in which an inner \"core chassis\" is first created before a secondary outer \"exoframe\" is built upon that core, including additional armor, brachial/limb extensions, and hardpoints. The end result is a deceptively elegant design capable of not only extensive customization but also exceptionally simple field repairs. A series of interlocking clamps and explosive bolts anchor various exoframe components and appendages in place, and when sufficient structural integrity is compromised these sections can be swiftly jettisoned and just as quickly replaced, allowing Legionnaires to continue fighting through catastrophic damage that would render other chassis inoperable.<br><br>This construction also allows power to be selectively rerouted between the core chassis and exoframe components, bypassing system failures and even enhancing overall performance for brief periods, though the strain this puts on the exoframe necessarily limits its use to critical situations only.",
        "passive_name": "Exoframe Engineering",
        "passive_effect": "The Gilgamesh has a modular construction framework which allows it to easily make in-field repairs by blowing off and replacing damaged limbs and components with spares. 1/scene as a free action, you may choose one of the following:<ul><li>Regain 1/2 of your total HP.</li><li>Repair a destroyed weapon or system.</li></ul>If you don't use this ability during combat, then when you next rest you may either regain all HP or automatically repair a destroyed weapon or system.<br><br>Using this ability during combat counts as expending a Limited charge.",
        "active_name": "Exo Amplification",
        "activation": "Protocol",
        "active_effect": "You gain Immunity to all conditions not caused by your own systems, talents, etc, until the end of your next turn, and clear all such conditions you already have (including that that can't be cleared normally). You also clear Exposed, stand from Prone, and gain Grit+4 Overshield. At the end of your next turn, clear this Overshield. This ability can be used even if you would not normally be able to take this action (e.g., if you are Stunned).<br><br>Using this ability during combat counts as expending a Limited charge."
      },
      "image_url": "https://d2c79xe1p61csc.cloudfront.net/frames/gilgamesh.png",
      "y_pos": 0
    },
    {
      "id": "mf_amber_phantom",
      "license_level": 2,
      "source": "SSC",
      "name": "Amber Phantom",
      "variant": "Metalmark",
      "mechtype": [
        "Striker"
      ],
      "description": "Created as an advanced strike chassis for SSC's INSIGHT ORDINAL next-generation weapons evaluation program, the Amber Phantom represents the culmination of numerous technologies developed under the BELLA CIAO line into a single hyperspec, high-performance frame. Based primarily upon the Metalmark platform, the Amber Phantom incorporates an advanced neural bridge derived from the Death's Head's precognitive targeting system in conjunction with TACSIM choral processors in order to amplify the pilot's situational awareness to beyond-human levels.<br><br>The result of this synergy is an uncanny level of mind/machine-integrated performance akin to seeing into the future. Amber Phantom pilots appear to casually sidestep incoming fire, and their attacks are perfectly timed to intersect enemy positions without any wasted movement. This system is not without its drawbacks; extended use of the neural bridge is said to result in feelings of intense déjà vu, temporal dissociation, and dyschronometria, and pilots are strongly advised to maintain regular downtime rotation cycles and centering exercises in order to minimize these risks.<br><br>Not currently in widespread distribution, the Amber Phantom has seen extensive use among Constellar special forces, and is also available to select SSC clients under a full-disclosure data sharing and promotional rights agreement.",
      "mounts": [
        "Flex",
        "Main",
        "Main/Aux"
      ],
      "stats": {
        "size": 1,
        "structure": 4,
        "stress": 4,
        "armor": 0,
        "hp": 8,
        "evasion": 12,
        "edef": 6,
        "heatcap": 5,
        "repcap": 4,
        "sensor_range": 10,
        "tech_attack": 0,
        "save": 10,
        "speed": 5,
        "sp": 5
      },
      "traits": [
        {
          "name": "Hyperawareness",
          "description": "At the start of each round, until the Amber Phantom takes its turn, all attacks against it are made with +1 Difficulty and it makes all saves with +1 Accuracy."
        },
        {
          "name": "Battle Oracle",
          "description": "1/round, when a hostile character misses the Amber Phantom with an attack, it may pull a character within Sensors up to 2 spaces in any direction."
        }
      ],
      "core_system": {
        "name": "Possibility Mapping",
        "description": "SSC's precognitive neural bridging systems are not paracausal as the name might suggest. Using carefully modulated neural stimulation and acceleration, the operator's ability to consciously process and assimilate even subconsciously-derived sensory input is greatly amplified, reducing feedback delay and enhancing reaction time to near-instinctive levels. This then allows users to more accurately predict immediate future occurrences based on comprehensive sensory awareness and intuitive analysis, hence precognition.<br><br>To further enhance this system's capability, the Amber Phantom marries precognitive bridging with a chorus of predictive modeling and tactical simulation systems to provide the pilot with even more information. The result is the creation of a holistic battlefield timeline continuously extending forward several seconds in advance of realtime, granting users an unparalleled ability to choose the precise, optimal moment to act in all situations, reacting to ongoing events even before they occur.",
        "passive_name": "Possibility Mapping",
        "passive_effect": "At the start of each round, choose a point during the PC turn order to act (i.e. if there are three PCs, you can choose to act first, second, or third among them). 1/round, if you take your turn during that point, you may deal +1d6 bonus damage on hit with a ranged or melee attack against a target within Sensors. If you take your turn at another point in the round, you may still gain this bonus damage, but you take 1d6 heat when doing so.",
        "active_name": "Convergence Point",
        "activation": "Protocol",
        "active_effect": "Choose one allied character that has not taken their turn this round. That character may take their turn either immediately after your turn ends, or they may take their turn now before you do anything else, pausing your own turn until their turn ends. If they choose to act now, they count as acting before you in the PC turn order. This ability is <b>Efficient</b> and will refund 1 Core Point at the end of any scene in which this ability was used."
      },
      "image_url": "https://d2c79xe1p61csc.cloudfront.net/frames/amber_phantom.png",
      "y_pos": 0
    },
    {
      "id": "mf_lycan",
      "license_level": 2,
      "source": "HORUS",
      "name": "Lycan",
      "variant": "Manticore",
      "mechtype": [
        "Defender",
        "Striker"
      ],
      "description": "Despite its recent appearance, the Manticore has quickly become one of the most readily identifiable HORUS pattern-groups due to its distinctive electromagnetic signature and indiscriminately destructive energy bleed-off. While this recognition lends itself well to the Manticore's fearsome reputation, it also limits the design's strategic applications to direct assaults where early detection and collateral damage are of minimal consequence.<br><br>It remains unclear if the Lycan was designed in parallel to the Manticore or if it represents a subsequent development, but while it's clear that the Lycan is derived from the Manticore PG, it decouples the base chassis' heavy armor and hardpoint capability from the Manticore's more volatile systems. The resulting design is far less dangerous for the pilot, and far more capable of concealing its signature as well as the full extent of its capabilities, allowing it to operate with greater discretion until absolutely necessary.<br><br>As a result, the Lycan excels at ambush and counter-ambush tactics, capable of masquerading as a more conventional chassis until the opportunity presents itself, then shedding its baffle-lined outer carapace and shifting into a hyper-aggressive close-combat mode in order to dispatch its targets.",
      "mounts": [
        "Flex",
        "Heavy"
      ],
      "stats": {
        "size": 1,
        "structure": 4,
        "stress": 4,
        "armor": 2,
        "hp": 8,
        "evasion": 6,
        "edef": 10,
        "heatcap": 6,
        "repcap": 3,
        "sensor_range": 8,
        "tech_attack": 1,
        "save": 10,
        "speed": 3,
        "sp": 6
      },
      "traits": [
        {
          "name": "Slag Carapace",
          "description": "The Lycan has resistance to Energy Damage and Burn."
        },
        {
          "name": "Interference Field",
          "description": "All hostile characters within Range 3 of the Lycan take +1 Difficulty on all attacks that do not target the Lycan."
        },
        {
          "name": "Power Flux",
          "description": "1/round, when the Lycan takes heat, a hostile character within Range 3 must pass a Systems save or become Impaired and Slowed until the end of their next turn."
        }
      ],
      "core_system": {
        "name": "Subversive Signature",
        "description": "As a chassis designed for covert operations, the Lycan leverages the Manticore's affinity for electromagnetics in order to further obscure its precise nature, wrapping itself in a layered mesh of sensor baffles and wideband interference signals that disrupt and distort recognition scans and targeting systems. The effects of this distortion field are so intense that they even cause sporadic, uncontrolled power fluctuations in nearby systems, and pilots who have survived combat with Lycan PG chassis report experiencing intermittent electronics blackouts and even reduced reactor output upon approach.<br><br>However, the most distinctive feature of the Lycan by far is its ability to shift from its default, heavily-armored configuration to a more aggressive assault mode. This transformation is dramatic and known to cause panic among enemy forces as the Lycan's true nature is suddenly revealed in an explosive jettisoning of armor plating and a violent surge of power diverted towards the chassis' concealed shock claws, a series of retractable, high-temperature arc blades based on Manticore armament designs and embedded with a series of retaliatory \"self-sharpening\" heuristics.",
        "active_name": "Go Loud",
        "activation": "Full",
        "active_effect": "You violently jettison the Lycan's external carapace, extending brutal talons and supercharging its reactor. For the rest of the scene, your base Armor becomes 0, your base Speed becomes 6, Slag Carapace and Interference Field are disabled, and you gain the Shock Claws integrated weapon.<br<br>You may then charge forward to strike, moving your Speed and making an attack against a target within Range using the Shock Claws. This attack counts as a Barrage for the purpose of duplicate action restrictions.<br><br>Before activation, this weapon's output can be enhanced by proximity to extreme structural damage. The first time in a scene that an allied Mech character within Sensors takes structure damage from a hostile source before you activate Go Loud, this weapon becomes Threat 2. If this happens a second time before activating it, this weapon now also deals 4d6+6 energy damage instead of 3d6+6.<br><br>If an allied Mech character is destroyed before you activate Go Loud, or if you activate it while at 2 Structure or less, you automatically gain both of these additional benefits.<br><br>This ability is <b>Efficient</b> and will refund 1 Core Point at the end of any scene in which this ability was used.",
        "integrated": [
          "mw_integrated_shock_claws"
        ]
      },
      "image_url": "https://d2c79xe1p61csc.cloudfront.net/frames/lycan.png",
      "y_pos": 0
    },
    {
      "id": "mf_kutuzov",
      "license_level": 2,
      "source": "HA",
      "name": "Kutuzov",
      "variant": "Napoleon",
      "mechtype": [
        "Defender",
        "Support"
      ],
      "description": "Following the initial testbed development of the Napoleon and its successful proof-of-concept demonstration of numerous advanced blinkspace and stasis technologies, Harrison Armory immediately approved a series of ongoing developmental programs to expand the application of these systems across a number of successor chassis and block upgrade packages. One of the earliest of these successor programs, the Kutuzov was designed for Armory Naval Command as a boarding action force multiplier, taking the Napoleon's incredible self-sustainability and turning it outwards to create a compact and maneuverable projected defense platform ideal for accompanying marine or chassis squads into close-quarters engagements.<br><br>Unlike the more iconic Saladin, the Kutuzov remains unsuited to frontline engagement, and its own personal survivability metrics are notably reduced from the Napoleon itself. However, its robust array of waveform projectors are designed for sustained operation under even critical system stresses, and its ability to rapidly disseminate flash-projected barriers in response to incoming fire have shown extremely promising results both during training exercises as well as limited live-combat engagements during anti-piracy operations. Alongside the Iskander-CC, the Kutuzov has also begun to see increasing use as a perimeter security and riot-control unit during low-intensity defensive actions on New Madrassa.",
      "mounts": [
        "Main/Aux"
      ],
      "stats": {
        "size": 0.5,
        "structure": 4,
        "stress": 4,
        "armor": 2,
        "hp": 6,
        "evasion": 8,
        "edef": 10,
        "heatcap": 8,
        "repcap": 3,
        "sensor_range": 5,
        "tech_attack": 0,
        "save": 11,
        "speed": 4,
        "sp": 7
      },
      "traits": [
        {
          "name": "Expulsion Zone",
          "description": "1/round, when the Kutuzov Activates or otherwise uses a Shield system during its turn, it may knock all hostile characters of its choice within Sensors back 3 spaces."
        },
        {
          "name": "Emergency Blinkfields",
          "description": "Whenever the Kutuzov or any allied character within Sensors takes the Brace reaction, they clear Shredded (or ignore its effects if it can't be cleared normally) from hostile sources, and attacks they Brace against can't inflict Shredded."
        }
      ],
      "core_system": {
        "name": "Parallel Projectors",
        "description": "One of the Kutuzov's most distinct features is its series of integrated parallel-tracked field emitters, allowing for the simultaneous modulation and projection of multiple overlapping waveform patterns. This includes standard superpositional barriers and stasis fields as well as more aggressively-tuned fields designed for the take-and-hold operations the Kutuzov is tasked with, forcefully displacing threats during close-quarters engagements and clearing zones for subsequent barrier deployment to establish reinforced strongpoints.<br><br>Among these other uses, these emitters are capable of \"flashing\" a single-plane form of the Napoleon's Trueblack Aegis as a short-lived interpositional countermeasure. Without the excessive demands of sustaining a total-coverage envelope, the operational range of the Aegis can be increased through a series of point-defense tracking protocols and set to neutralize all hostile engagement from selected targets. However, the drawback to this implementation is immediately obvious, with a reduced shield profile, unresolved interference with outgoing fire, and the field emitters requiring an extensive power-cycling period before they can be reactivated once more.",
        "passive_name": "Parallel Projectors",
        "passive_effect": "1/round, when you take the Stabilize action, Bolster Quick Tech action, or Activate or otherwise use a Shield system during your turn, you may grant an allied character within Sensors a benefit based on the overall cost of that action:<ul><li>Free Action: They gain soft cover until the end of their next turn.</li><li>Quick Action: They ignore engagement, their movement doesn't provoke reactions, and they may pass through (but not stop in) spaces occupied by obstructions and other characters until the end of their next turn.</li><li>Full Action: They may clear a condition that wasn't caused by one of their own systems, talents, etc.</li></ul><br><br>You can choose a benefit from a lower action cost if you like, instead (e.g., if you performed a full action, you could choose the quick action or free action options).",
        "active_name": "Projected Aegis",
        "activation": "Quick",
        "active_effect": "Choose an allied character within line of sight, and then choose a hostile character within line of sight. Until the end of your next turn, those characters can't attack each other or force saves against each other via actions. This ability counts as a system with the <b>Shield</b> tag.<br><br>This ability is <b>Efficient</b> and will refund 1 Core Point at the end of any scene in which this ability was used."
      },
      "image_url": "https://d2c79xe1p61csc.cloudfront.net/frames/kutuzov.png",
      "y_pos": 0
    }
  ],
  "lcp_manifest.json": {
    "name": "Operation Winter Scar",
    "author": "Massif Press",
    "description": "Operation Winter Scar is a structured mission module for Lancer, written and designed by Kai Tave as a followup to Operation Solstice Rain, continuing the narrative first established there. Having played Operation Solstice Rain prior to this module is recommended, but not necessary. This module takes characters from License Level 2 to LL4 across two missions, pitting the now-seasoned pilots against the might of the Vestan Sovereignty Armed Forces. From advanced combat chassis to main battle tanks, the Sovereignty will stop at nothing in their efforts to push the pilots of Task Force Indigo and their Vestan resistance allies back, all the while the threat of TARTARUS hangs overhead. Special thanks to by Nasajin, who built and maintained the preview version of this LCP.",
    "item_prefix": "winterscar",
    "version": "1.0.0",
    "image_url": "https://d2c79xe1p61csc.cloudfront.net/other/ows-cover.jpg",
    "website": "https://massif-press.itch.io/winter-scar"
  },
  "mods.json": [
    {
      "id": "mw_bounder_class_comp_con",
      "name": "BOUNDER-Class Comp/Con",
      "sp": 3,
      "allowed_types": [
        "CQB",
        "Rifle",
        "Cannon"
      ],
      "source": "EXOTIC",
      "license": "",
      "license_level": 0,
      "effect": "This Mod does not work with Blast, Burst, Line, or Cone weapons. 1/round you may choose one of the following:<ul><li>When you miss an attack with this weapon, you may reroll that attack against a different target, tracing Range and line of sight from the original target's location.</li><li>You may bank your shot around corners and off of the environment to hit distant targets. Choose a piece of terrain or object Size 1 or larger within the weapon's Range and line of sight. When you make your attack, you may trace Range and line of sight from that location instead.</li><li>When you roll a 20 on a die for this attack (sometimes called a \"natural 20\"), you may riccochet the shot to strike a critical area on the target. The attack's damage can't be reduced in any way, and on hit the target is knocked Prone.</li></ul><br><br>This system isn't a full NHP and cannot enter cascade.",
      "description": "Originally planned as part of the \"Campbell\" license package, which ultimately lost to the Caliban during selection trials, the BOUNDER-class comp/con nonetheless represents one of IPS-N's latest developments in next-generation smart weapons design. The Campbell program was intended to facilitate successful boarding actions through indirect targeting solutions, minimizing the risk of incoming retaliatory fire, and although the Campbell was ultimately never adopted, BOUNDER remains available as a self-contained license for requisition.<br><br>BOUNDER is a joint hardware/software package suitable for most mainline armaments, designed to maximize surface reflectivity and projectile/waveform cohesion through a combination of specialized ammunition, variable electromagnetic lensing, and adjustable firing profiles. Thanks to the system's advanced ballistic calculation capabilities, users are able accurately chart oblique firing solutions across hard surfaces in realtime with acceptable accuracy.<br><br>Lessons learned from the infamous UNCLE-class comp/con have resulted in a much more stable and user-friendly experience, though some pilots with experience of both systems claim they find UNCLE's idiosyncrasies more endearing than BOUNDER's polished, but less eccentric, personality.",
      "tags": [
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_ai"
        },
        {
          "id": "tg_no_cascade"
        },
        {
          "id": "tg_exotic"
        }
      ]
    }
  ],
  "systems.json": [
    {
      "id": "ms_emergency_repair_module",
      "name": "Emergency Repair Module",
      "source": "HA",
      "license": "Gilgamesh",
      "license_level": 1,
      "description": "Emergency repair modules are often a mainstay on Armory chassis galaxy-wide. Through a combination of active nanite slurry, hardpatch welding, and shunting to redundant systems in response to immediate damage, they ensure that a chassis will be able to quickly complete nonmassive battlefield repairs in order to remain operational. A number of informal celebratory traditions have arisen throughout the legions to commemorate a pilot's first time taking damage sufficient to trigger an ERM in combat.",
      "effect": "Whenever you or an adjacent ally Braces, you may expend a charge and spend 1 Repair to restore that character's HP to full immediately after they take damage from the triggering attack. If that character took structure damage from the triggering attack, they also roll one less die on the structure damage check to a minimum of 0 (which results in no effect).",
      "type": "System",
      "sp": 1,
      "tags": [
        {
          "id": "tg_limited",
          "val": 1
        },
        {
          "id": "tg_unique"
        }
      ]
    },
    {
      "id": "ms_spear_charges",
      "name": "SPEAR Charges",
      "source": "HA",
      "license": "Gilgamesh",
      "license_level": 3,
      "description": "Only recently approved for widespread distribution throughout Legion forces, the Special Purpose Enhanced Anti-armor Rocket is a lightweight munition delivery system designed to be used in place of larger payload weapons such as the GMS MC-RPG or the Snapdragon ACGM. Designed for ease of use with minimal training and fired from disposable tube launchers, each rocket can either be used in direct-fire mode or set to loiter over an area, initiating top-down terminal interception upon recognizing hostile contact within its established threat perimeter.",
      "type": "System",
      "sp": 3,
      "tags": [
        {
          "id": "tg_limited",
          "val": 2
        },
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_grenade"
        }
      ],
      "actions": [
        {
          "name": "Anti-Armor Rocket",
          "activation": "Quick",
          "detail": "You fire a rocket, targeting a single character within range 10. Your target must pass an Agility save or take 6 AP explosive damage. On a success, they take half damage."
        }
      ],
      "deployables": [
        {
          "name": "Loitering Payload",
          "type": "Mine",
          "detail": "Deploy a loitering payload to a free space within range 3, where it establishes a Burst 2 area. When deployed, this mine's area cannot overlap any hostile characters. This advanced munition does not detonate normally; instead, the next time a hostile character voluntarily moves more than 1 space while within its area, up to 10 spaces high, the payload immediately launches itself at them, detonating. They must pass an Agility save or take 2d6 AP explosive damage and immediately stop and lose all remaining movement. On a success, they take half damage only. Failing to disarm this mine also causes it to detonate against that character. A character can only trigger one loitering payload per turn."
        }
      ]
    },
    {
      "id": "ms_utility_drone",
      "name": "Utility Drone",
      "source": "HA",
      "license": "Gilgamesh",
      "license_level": 2,
      "type": "System",
      "sp": 2,
      "description": "Mass produced and distributed to Armory legions wherever they may find themselves deployed, the \"Argos\" utility drone is a common sight throughout the Purview and beyond. Legionnaire doctrine calls for extensive use of Argos drones to supplement and enhance squad performance, with each drone serving as a multipurpose platform incorporating numerous systems and components, including threat interception arrays, electrostatic discharge area denial/suppression projectors, and field diagnostic loadouts.",
      "tags": [
        {
          "id": "tg_limited",
          "val": 2
        },
        {
          "id": "tg_unique"
        }
      ],
      "deployables": [
        {
          "name": "Utility Drone",
          "type": "Drone",
          "detail": "Expend 1-2 charges to deploy that many utility drones to free spaces within Sensors where they each create a Burst 2 area. Hostile characters within this area make all checks and saves with +1 Difficulty, and all allied characters within this area gain +1 Accuracy on all checks and saves. This effect does not stack with other utility drones.<br><br>The utility drone can be redeployed to a new location as a quick action. It cannot be recalled and expires at the end of the scene.",
          "size": 0.5,
          "activation": "Quick",
          "redeploy": "Quick",
          "instances": 1,
          "cost": 1,
          "hp": 5,
          "evasion": 10,
          "edef": 10
        }
      ]
    },
    {
      "id": "ms_quickfoam_charges",
      "name": "Quickfoam Charges",
      "source": "EXOTIC",
      "license": "",
      "license_level": 0,
      "description": "A common piece of equipment aboard commercial and military spacefaring vessels alike, \"quickfoam\" is a self-curing polymer foam laced with whitewash utility nanites that rapidly expands and hardens even in null-atmosphere conditions, used to seal hull breaches and sustain compromised systems. While not considered part of a standard combat loadout, marine pilots often make use of deployable airburst cannisters full of the substance to effect in-field emergency repairs or to set improvised snare traps in chokepoints and access corridors.",
      "type": "System",
      "sp": 3,
      "tags": [
        {
          "id": "tg_limited",
          "val": 2
        },
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_grenade"
        },
        {
          "id": "tg_exotic"
        }
      ],
      "actions": [
        {
          "name": "Patch Grenade",
          "activation": "Quick",
          "detail": "You throw a grenade, targeting a character within Range 5. When used on an allied character, you Bolster the target and they may clear one hostile condition. When used on a hostile character, they become Impaired and Slowed until the end of their next turn."
        }
      ],
      "deployables": [
        {
          "name": "Sealant Mine",
          "type": "Mine",
          "detail": "Deploy a sealant mine which establishes a Burst 1 area. This mine detonates when a character moves adjacent to or over it. All allied characters (including yourself) within the affected area gain Grit+4 Overshield and clear all burn. All hostile characters in the affected area become Immobilized by quick-curing foam sealant, which hardens in place. They remain Immobilized until the hardened foam takes enough damage to break; it counts as an object with 10 HP and Evasion 5."
        }
      ]
    }
  ],
  "weapons.json": [
    {
      "id": "mw_integrated_shock_claws",
      "name": "Shock Claws",
      "mount": "Superheavy",
      "type": "Melee",
      "profiles": [
        {
          "name": "Shock Claws",
          "range": [
            {
              "type": "Threat",
              "val": 1
            }
          ],
          "damage": [
            {
              "type": "Energy",
              "val": "3d6+6"
            }
          ],
          "tags": [
            {
              "id": "tg_ap"
            },
            {
              "id": "tg_accurate"
            },
            {
              "id": "tg_overkill"
            }
          ],
          "effect": "This weapon may only be used during the Go Loud core power. This weapon can't be used to attack in the same turn as another Heavy or Superheavy weapon.",
          "on_attack": "You may deal 1d6 AP energy damage to a different character of your choice within Range 3 of the target."
        },
        {
          "name": "Damaged",
          "range": [
            {
              "type": "Threat",
              "val": 2
            }
          ],
          "damage": [
            {
              "type": "Energy",
              "val": "3d6+6"
            }
          ],
          "tags": [
            {
              "id": "tg_ap"
            },
            {
              "id": "tg_accurate"
            },
            {
              "id": "tg_overkill"
            }
          ],
          "effect": "This weapon may only be used during the Go Loud core power. The first time in a scene an allied Mech character within Sensors takes structure damage before Going Loud, this profile replaces the default Shock Claws profile. This weapon can't be used to attack in the same turn as another Heavy or Superheavy weapon.",
          "on_attack": "You may deal 1d6 AP energy damage to a different character of your choice within Range 3 of the target."
        },
        {
          "name": "Ruined",
          "range": [
            {
              "type": "Threat",
              "val": 2
            }
          ],
          "damage": [
            {
              "type": "Energy",
              "val": "4d6+6"
            }
          ],
          "tags": [
            {
              "id": "tg_ap"
            },
            {
              "id": "tg_accurate"
            },
            {
              "id": "tg_overkill"
            }
          ],
          "effect": "This weapon may only be used during the Go Loud core power. If you Go Loud after allied Mech characters within Sensors take structure damage twice or more during the scene, an allied Mech character is destroyed, or while at 2 structure or less, this profile replaces the default Shock Claws profile. This weapon can't be used to attack in the same turn as another Heavy or Superheavy weapon.",
          "on_attack": "You may deal 1d6 AP energy damage to a different character of your choice within Range 3 of the target."
        }
      ]
    },
    {
      "id": "mw_legionnaire_battle_rifle",
      "name": "Legionnaire Battle Rifle",
      "source": "HA",
      "license": "Gilgamesh",
      "license_level": 1,
      "mount": "Heavy",
      "type": "Rifle",
      "description": "Harrison Armory's primary model Legionnaire heavy battle rifle is a mainstay of both regular and auxiliary Armory forces regardless of theater or world of origin, standardizing logistics and streamlining integration of foreign and local assets. Chambered in a high-caliber round, the weapon is both inexpensive to print and easy to operate despite its size, and its robust design allows for sustained volumes of both precision and saturation fire even across extended engagements. Legionnaire pilots are rigorously trained in fire discipline, but enthusiastic recruits are still known to make up for a lack of experience with an excess of ammunition.",
      "damage": [
        {
          "type": "Kinetic",
          "val": "1d6+3"
        }
      ],
      "range": [
        {
          "type": "Range",
          "val": 15
        }
      ],
      "tags": [
        {
          "id": "tg_limited",
          "val": 3
        }
      ],
      "effect": "You may attack with this weapon without expending or requiring charges, and this weapon can be destroyed (due to critical damage or other effects) even if it has no charges remaining.",
      "on_attack": "You may expend up to 3 charges. For each charge expended you may either gain +2 Reliable for the attack or, on hit, push the target character 1 space in any direction."
    },
    {
      "id": "mw_superthermal_blade",
      "name": "Superthermal Blade",
      "source": "HA",
      "license": "Gilgamesh",
      "license_level": 2,
      "mount": "Main",
      "type": "Melee",
      "description": "Available in a variety of designs curated for maximum cultural appeal, the Armory's line of thermoconductive blades are considered status symbols among some legionnaires. At nominal power, the blade is merely a conventional, if solidly designed, chassis-grade tactical melee weapon, but when the blade draws additional power from a chassis' reactor via hard-cable or induction feeds, its striking edge is instantly superheated to extreme temperatures.",
      "damage": [
        {
          "type": "Energy",
          "val": "1d6"
        },
        {
          "type": "Heat",
          "val": 1
        }
      ],
      "range": [
        {
          "type": "Threat",
          "val": 1
        }
      ],
      "tags": [
        {
          "id": "tg_ap"
        },
        {
          "id": "tg_limited",
          "val": 2
        },
        {
          "id": "tg_heat_self",
          "val": 1
        },
        {
          "id": "tg_unique"
        }
      ],
      "effect": "You may attack with this weapon without expending or requiring charges, and this weapon can be destroyed (due to critical damage or other effects) even if it has no charges remaining.",
      "on_hit": "1/round, if you are in the Danger Zone you may expend a charge to to deal +3 heat; if you are not in the Danger Zone, you may take 3 heat to expend a charge for the same effect."
    },
    {
      "id": "mw_legion_nexus",
      "name": "Legion Nexus",
      "source": "HA",
      "license": "Gilgamesh",
      "license_level": 3,
      "mount": "Superheavy",
      "sp": 2,
      "type": "Nexus",
      "description": "The PRAETORIAN combat subaltern is one of the Armory's latest and most advanced models, designed for shock assault, seize-and-hold, and combined arms doctrines. Utilizing a tiered hierarchy/command structure allowing them to operate at levels ranging from individual fire teams to brigade strength under local comp/con or NHP command, a squadron of PRAETORIAN subalterns can also be seconded to pilots under local nexus node control, and one or more squadrons are often assigned to legionnaire units during combat operations to provide integrated support.",
      "damage": [
        {
          "type": "Kinetic",
          "val": "3d6"
        }
      ],
      "range": [
        {
          "type": "Range",
          "val": "10"
        }
      ],
      "tags": [
        {
          "id": "tg_smart"
        },
        {
          "id": "tg_limited",
          "val": 3
        },
        {
          "id": "tg_heat_self",
          "val": 2
        }
      ],
      "effect": "1/round, after attacking with this weapon, you may expend a charge as a free action to task a team of subalterns to operate independently from the main unit. This counts as a Drone deployed in a free space adjacent to you. You may attack with this weapon without expending or requiring charges, and this weapon can be destroyed (due to critical damage or other effects) even if it has no charges remaining.",
      "deployables": [
        {
          "name": "Legion Drone",
          "type": "Drone",
          "detail": "As a protocol, you may move each deployed legion drone you control up to 3 spaces and order each of them to perform one of the following commands:<ul><li>Suppression Protocols: Choose a hostile character within Range 5 of the drone. Your attacks with the legion nexus against them gain +1 Accuracy until the end of their next turn. This effect does not stack. That character must also pass an Agility save or become Impaired until the end of their next turn.</li><li>Assault Position: A hostile character adjacent to the drone must pass a Hull save or be knocked back 1 space and be knocked Prone. Until the start of your next turn, the drone counts as Size 1 and adjacent allied characters can use it for hard cover.</li></ul>For each deployed legion drone you control, the legion nexus deals +2 damage on hit to a maximum of +6. Legion drones cannot be recalled and expire at the end of the scene.",
          "size": 0.5,
          "instances": 1,
          "activation": "Free",
          "cost": 1,
          "armor": 1,
          "hp": 5,
          "evasion": 10,
          "edef": 10
        }
      ]
    },
    {
      "id": "mw_shrapnel_cannon",
      "name": "Shrapnel Cannon",
      "source": "EXOTIC",
      "license": "",
      "license_level": 0,
      "mount": "Main",
      "type": "Cannon",
      "description": "Clearing the cramped corridors and hallways of spaceships requires weaponry capable of engaging threats at all angles, even around corners or behind cover. A simple and brutally effective weapon, the shrapnel cannon fires explosive shells lined with a metal/polymer composite that erupts into deadly shards upon detonation. The composite's elasticity is sufficient to enable these shards to ricochet off hard surfaces without compromising terminal ballistics, enabling wide-coverage indirect fire across spaces where traditional CQB weapons can't reach without exposing the operator in turn.",
      "damage": [
        {
          "type": "Explosive",
          "val": "1d6+1"
        }
      ],
      "range": [
        {
          "type": "Range",
          "val": 8
        }
      ],
      "tags": [
        {
          "id": "tg_exotic"
        }
      ],
      "on_hit": "This weapon creates a Cone 5 area originating from the target, oriented away from them in a direction of your choice and tracing line of sight from that target. All units in this area must pass an Agility save or take 1d6 kinetic damage."
    },
    {
      "id": "mw_electrohydraulic_claw",
      "name": "Electrohydraulic Claw",
      "source": "EXOTIC",
      "license": "",
      "license_level": 0,
      "mount": "Main",
      "type": "Melee",
      "description": "A chassis-scale, weaponized version of the iconic search-and-rescue tool, IPS-N's electrohydraulic cutter/spreader claw is even more powerful than its utilitarian cousin. While the claw's reinforced cutting blades serve as an adequate, if clumsy, weapon on their own, their true potential lies in their ability to literally pry chassis apart when suitably braced, capable of shearing through even reinforced armor composites. The ability to easily bypass sealed doors and airlocks (or create alternate openings during breaching actions) lends the weapon additional versatility.",
      "damage": [
        {
          "type": "Kinetic",
          "val": "1d6+3"
        }
      ],
      "range": [
        {
          "type": "Threat",
          "val": 1
        }
      ],
      "tags": [
        {
          "id": "tg_inaccurate"
        },
        {
          "id": "tg_overkill"
        },
        {
          "id": "tg_exotic"
        }
      ],
      "effect": "1/round, you may activate the claws as a quick action when you hit a character with this weapon to automatically grapple them. Targets grappled this way must pass a Hull save or become Shredded until the end of their next turn.<br><br>This weapon deals 10 AP kinetic damage to objects, cover, and the environment. Additionally, you gain +1 Accuracy to all non-combat mech skill checks to pry heavy objects open or apart (e.g., sealed airlocks, jammed cockpits, vault doors, cargo containers, etc); this effect does not stack."
    },
    {
      "id": "mw_fusion_torch",
      "name": "Fusion Torch",
      "source": "EXOTIC",
      "license": "",
      "license_level": 0,
      "mount": "Heavy",
      "type": "CQB",
      "description": "The FS-90 \"Rockhammer\" directed high-output mining beam is a heavy industrial energy cutter used to carve apart starship-grade hulls and toughened asteroids for mineral extraction, channeling a focused beam of superheated energy capable of effortlessly melting through even reinforced bulkheads. Repurposed by IPS-N as an offensive chassis-mounted weapon system, the fusion torch works just as well against enemy armor, and its effectiveness as a breaching tool is second to none. Operators often refer to the glowing slag deposits which frequently adorn their frames as \"war paint.\"",
      "damage": [
        {
          "type": "Energy",
          "val": "2d6+2"
        }
      ],
      "range": [
        {
          "type": "Line",
          "val": 5
        }
      ],
      "tags": [
        {
          "id": "tg_ap"
        },
        {
          "id": "tg_overkill"
        },
        {
          "id": "tg_inaccurate"
        },
        {
          "id": "tg_heat_self",
          "val": 2
        },
        {
          "id": "tg_exotic"
        }
      ],
      "on_attack": "This weapon automatically deals 30 AP energy damage to objects, cover, and terrain within its area, leaving behind clouds of molten debris in their place that linger until the end of your next turn. Characters other than you that begin their turn in these clouds or who enter them for the first time in a round take 1d6 energy damage. As long as you are at least partially within a cloud, you gain soft cover."
    }
  ]
}
